[Killed] ObjectLiteral
src/app.router.ts:16:38
 import { sessionsRouter } from "./routers/sessions.router";
 import { staffRouter } from "./routers/staff.router";
 
-export const appRouter = trpc.router({
-  branches: branchesRouter,
-  catalogue: catalogueRouter,
-  rates: ratesRouter,
-  rooms: roomsRouter,
-  sessions: sessionsRouter,
-  staff: staffRouter,
-});
+export const appRouter = trpc.router({});
 
 export type AppRouter = typeof appRouter;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 227ms

 ✓ test/data-client.test.ts (12 tests) 92ms
