[Killed] EqualityOperator
src/context.ts:37:39
 
 export async function createTrpcContext(options: CreateTrpcContextOptions): Promise<TrpcContext> {
   const anonymous: TrpcContext = { caller: null, data: null };
-  if (options.accessToken === null || options.accessToken === "") {
+  if (options.accessToken === null || options.accessToken !== "") {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 192ms

 ✓ test/data-client.test.ts (12 tests) 157ms

[Killed] EqualityOperator
src/context.ts:37:7
 
 export async function createTrpcContext(options: CreateTrpcContextOptions): Promise<TrpcContext> {
   const anonymous: TrpcContext = { caller: null, data: null };
-  if (options.accessToken === null || options.accessToken === "") {
+  if (options.accessToken !== null || options.accessToken === "") {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 118ms

 ✓ test/data-client.test.ts (12 tests) 111ms

[Killed] ObjectLiteral
src/context.ts:41:88
     return anonymous;
   }
 
-  const authClient = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
-  });
+  const authClient = createSupabaseClient(options.supabaseUrl, options.publishableKey, {});
   const { data, error } = await authClient.auth.getClaims(options.accessToken);
   if (error !== null || data === null) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 102ms

 ✓ test/data-client.test.ts (12 tests) 93ms

[Killed] BooleanLiteral
src/context.ts:42:29
   }
 
   const authClient = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
+    auth: { persistSession: true, autoRefreshToken: false },
   });
   const { data, error } = await authClient.auth.getClaims(options.accessToken);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 96ms

 ✓ test/data-client.test.ts (12 tests) 120ms

[Killed] BooleanLiteral
src/context.ts:42:54
   }
 
   const authClient = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
+    auth: { persistSession: false, autoRefreshToken: true },
   });
   const { data, error } = await authClient.auth.getClaims(options.accessToken);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 115ms

 ✓ test/data-client.test.ts (12 tests) 121ms

[Killed] LogicalOperator
src/context.ts:45:7
     auth: { persistSession: false, autoRefreshToken: false },
   });
   const { data, error } = await authClient.auth.getClaims(options.accessToken);
-  if (error !== null || data === null) {
+  if (error !== null && data === null) {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 109ms

 ✓ test/data-client.test.ts (12 tests) 96ms

[Killed] ConditionalExpression
src/context.ts:45:7
     auth: { persistSession: false, autoRefreshToken: false },
   });
   const { data, error } = await authClient.auth.getClaims(options.accessToken);
-  if (error !== null || data === null) {
+  if (false) {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 117ms

 ✓ test/data-client.test.ts (12 tests) 117ms

[Killed] EqualityOperator
src/context.ts:49:7
     return anonymous;
   }
   const claims = readAppClaims(data.claims);
-  if (claims === null) {
+  if (claims !== null) {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 138ms

 ✓ test/data-client.test.ts (12 tests) 89ms

[Killed] ConditionalExpression
src/context.ts:49:7
     return anonymous;
   }
   const claims = readAppClaims(data.claims);
-  if (claims === null) {
+  if (true) {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 118ms

 ✓ test/data-client.test.ts (12 tests) 95ms

[Killed] BlockStatement
src/context.ts:53:32
     return anonymous;
   }
   const sub = (data.claims as Record<string, unknown>).sub;
-  if (typeof sub !== "string") {
-    return anonymous;
-  }
+  if (typeof sub !== "string") {}
 
   const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 113ms

 ✓ test/data-client.test.ts (12 tests) 87ms

[Killed] ConditionalExpression
src/context.ts:53:7
     return anonymous;
   }
   const sub = (data.claims as Record<string, unknown>).sub;
-  if (typeof sub !== "string") {
+  if (false) {
     return anonymous;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 103ms

 ✓ test/data-client.test.ts (12 tests) 93ms

[Killed] ObjectLiteral
src/context.ts:57:86
     return anonymous;
   }
 
-  const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
-    global: { headers: { Authorization: `Bearer ${options.accessToken}` } },
-  });
+  const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {});
 
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 106ms

 ✓ test/data-client.test.ts (12 tests) 92ms

[Killed] BooleanLiteral
src/context.ts:58:54
   }
 
   const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
+    auth: { persistSession: false, autoRefreshToken: true },
     global: { headers: { Authorization: `Bearer ${options.accessToken}` } },
   });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 150ms

 ✓ test/data-client.test.ts (12 tests) 96ms

[Killed] BooleanLiteral
src/context.ts:58:29
   }
 
   const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
-    auth: { persistSession: false, autoRefreshToken: false },
+    auth: { persistSession: true, autoRefreshToken: false },
     global: { headers: { Authorization: `Bearer ${options.accessToken}` } },
   });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 102ms

 ✓ test/data-client.test.ts (12 tests) 90ms

[Killed] ObjectLiteral
src/context.ts:59:24
 
   const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
     auth: { persistSession: false, autoRefreshToken: false },
-    global: { headers: { Authorization: `Bearer ${options.accessToken}` } },
+    global: { headers: {} },
   });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 113ms

 ✓ test/data-client.test.ts (12 tests) 83ms

[Killed] ObjectLiteral
src/context.ts:59:13
 
   const asCaller = createSupabaseClient(options.supabaseUrl, options.publishableKey, {
     auth: { persistSession: false, autoRefreshToken: false },
-    global: { headers: { Authorization: `Bearer ${options.accessToken}` } },
+    global: {},
   });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 125ms

 ✓ test/data-client.test.ts (12 tests) 73ms

[Killed] ObjectLiteral
src/context.ts:63:13
   });
 
   return {
-    caller: { userId: sub, claims },
+    caller: {},
     data: createSilidDataClient(asCaller),
   };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 108ms

 ✓ test/data-client.test.ts (12 tests) 97ms
