[Killed] BlockStatement
src/branch-scope.ts:15:22
   caller: Caller,
   data: SilidDataClient,
   decision: BranchScopeDecision,
-): Promise<string[]> {
-  switch (decision.kind) {
-    case "branch":
-      return [decision.branchId];
-    case "target":
-      // The lookup runs claim-scoped (RLS-governed); an invisible branch
-      // resolves to null and is refused. A resolved branch must still
-      // belong to the caller's claim organization.
-      return [assertTargetInScope(decision, await data.getBranch(decision.branchId))];
-    case "org":
-      // Defense in depth: filter the RLS-scoped set to the claim org.
-      return (await data.listBranches())
-        .filter((branch) => branch.orgId === caller.claims.org_id)
-        .map((branch) => branch.id);
-    case "platform":
-      // The platform tier reaches all organizations by design
-      // (spec/multi-tenancy.md §2); its reads are audited and RLS-scoped.
-      return (await data.listBranches()).map((branch) => branch.id);
-  }
-}
+): Promise<string[]> {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 115ms

 ✓ test/data-client.test.ts (12 tests) 102ms

[Killed] ConditionalExpression
src/branch-scope.ts:17:5
   decision: BranchScopeDecision,
 ): Promise<string[]> {
   switch (decision.kind) {
-    case "branch":
-      return [decision.branchId];
+    case "branch":
     case "target":
       // The lookup runs claim-scoped (RLS-governed); an invisible branch
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 110ms

 ✓ test/data-client.test.ts (12 tests) 91ms

[Killed] ArrayDeclaration
src/branch-scope.ts:18:14
 ): Promise<string[]> {
   switch (decision.kind) {
     case "branch":
-      return [decision.branchId];
+      return [];
     case "target":
       // The lookup runs claim-scoped (RLS-governed); an invisible branch
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 169ms

 ✓ test/data-client.test.ts (12 tests) 114ms

[Killed] ConditionalExpression
src/branch-scope.ts:19:5
   switch (decision.kind) {
     case "branch":
       return [decision.branchId];
-    case "target":
-      // The lookup runs claim-scoped (RLS-governed); an invisible branch
-      // resolves to null and is refused. A resolved branch must still
-      // belong to the caller's claim organization.
-      return [assertTargetInScope(decision, await data.getBranch(decision.branchId))];
+    case "target":
     case "org":
       // Defense in depth: filter the RLS-scoped set to the claim org.
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 107ms

 ✓ test/data-client.test.ts (12 tests) 137ms

[Killed] StringLiteral
src/branch-scope.ts:19:10
   switch (decision.kind) {
     case "branch":
       return [decision.branchId];
-    case "target":
+    case "":
       // The lookup runs claim-scoped (RLS-governed); an invisible branch
       // resolves to null and is refused. A resolved branch must still
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 126ms

 ✓ test/data-client.test.ts (12 tests) 91ms

[Killed] ArrayDeclaration
src/branch-scope.ts:23:14
       // The lookup runs claim-scoped (RLS-governed); an invisible branch
       // resolves to null and is refused. A resolved branch must still
       // belong to the caller's claim organization.
-      return [assertTargetInScope(decision, await data.getBranch(decision.branchId))];
+      return [];
     case "org":
       // Defense in depth: filter the RLS-scoped set to the claim org.
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 121ms

 ✓ test/data-client.test.ts (12 tests) 107ms

[Killed] ConditionalExpression
src/branch-scope.ts:24:5
       // resolves to null and is refused. A resolved branch must still
       // belong to the caller's claim organization.
       return [assertTargetInScope(decision, await data.getBranch(decision.branchId))];
-    case "org":
-      // Defense in depth: filter the RLS-scoped set to the claim org.
-      return (await data.listBranches())
-        .filter((branch) => branch.orgId === caller.claims.org_id)
-        .map((branch) => branch.id);
+    case "org":
     case "platform":
       // The platform tier reaches all organizations by design
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 140ms

 ✓ test/data-client.test.ts (12 tests) 142ms

[Killed] MethodExpression
src/branch-scope.ts:26:14
       return [assertTargetInScope(decision, await data.getBranch(decision.branchId))];
     case "org":
       // Defense in depth: filter the RLS-scoped set to the claim org.
-      return (await data.listBranches())
-        .filter((branch) => branch.orgId === caller.claims.org_id)
+      return await data.listBranches()
         .map((branch) => branch.id);
     case "platform":
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 127ms

 ✓ test/data-client.test.ts (12 tests) 94ms

[Killed] ArrowFunction
src/branch-scope.ts:27:17
     case "org":
       // Defense in depth: filter the RLS-scoped set to the claim org.
       return (await data.listBranches())
-        .filter((branch) => branch.orgId === caller.claims.org_id)
+        .filter(() => undefined)
         .map((branch) => branch.id);
     case "platform":
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 150ms

 ✓ test/data-client.test.ts (12 tests) 111ms

[Killed] ConditionalExpression
src/branch-scope.ts:27:29
     case "org":
       // Defense in depth: filter the RLS-scoped set to the claim org.
       return (await data.listBranches())
-        .filter((branch) => branch.orgId === caller.claims.org_id)
+        .filter((branch) => false)
         .map((branch) => branch.id);
     case "platform":
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 127ms

 ✓ test/data-client.test.ts (12 tests) 111ms

[Killed] ArrowFunction
src/branch-scope.ts:28:14
       // Defense in depth: filter the RLS-scoped set to the claim org.
       return (await data.listBranches())
         .filter((branch) => branch.orgId === caller.claims.org_id)
-        .map((branch) => branch.id);
+        .map(() => undefined);
     case "platform":
       // The platform tier reaches all organizations by design
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 135ms

 ✓ test/data-client.test.ts (12 tests) 90ms

[Killed] ConditionalExpression
src/branch-scope.ts:29:5
       return (await data.listBranches())
         .filter((branch) => branch.orgId === caller.claims.org_id)
         .map((branch) => branch.id);
-    case "platform":
-      // The platform tier reaches all organizations by design
-      // (spec/multi-tenancy.md §2); its reads are audited and RLS-scoped.
-      return (await data.listBranches()).map((branch) => branch.id);
+    case "platform":
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 137ms

 ✓ test/data-client.test.ts (12 tests) 93ms

[Killed] ArrowFunction
src/branch-scope.ts:32:46
     case "platform":
       // The platform tier reaches all organizations by design
       // (spec/multi-tenancy.md §2); its reads are audited and RLS-scoped.
-      return (await data.listBranches()).map((branch) => branch.id);
+      return (await data.listBranches()).map(() => undefined);
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 111ms

 ✓ test/data-client.test.ts (12 tests) 100ms
