[Killed] BlockStatement
src/data-client.ts:51:79
  * and validate it against the @silid/schemas schema — fail closed on any
  * row the schema refuses.
  */
-function parseOrThrow<T>(schema: ZodType<T>, view: unknown, table: string): T {
-  const parsed = schema.safeParse(view);
-  if (!parsed.success) {
-    throw new Error(`row from ${table} does not match its schema: ${parsed.error.message}`);
-  }
-  return parsed.data;
-}
+function parseOrThrow<T>(schema: ZodType<T>, view: unknown, table: string): T {}
 
 export function toBranchView(row: Row): BranchWithRateConfig {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 105ms

 ❯ test/data-client.test.ts (12 tests | 7 failed) 97ms

[Killed] BlockStatement
src/data-client.ts:53:24
  */
 function parseOrThrow<T>(schema: ZodType<T>, view: unknown, table: string): T {
   const parsed = schema.safeParse(view);
-  if (!parsed.success) {
-    throw new Error(`row from ${table} does not match its schema: ${parsed.error.message}`);
-  }
+  if (!parsed.success) {}
   return parsed.data;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 133ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 111ms

[Killed] ConditionalExpression
src/data-client.ts:53:7
  */
 function parseOrThrow<T>(schema: ZodType<T>, view: unknown, table: string): T {
   const parsed = schema.safeParse(view);
-  if (!parsed.success) {
+  if (false) {
     throw new Error(`row from ${table} does not match its schema: ${parsed.error.message}`);
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 108ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 127ms

[Killed] BlockStatement
src/data-client.ts:59:62
   return parsed.data;
 }
 
-export function toBranchView(row: Row): BranchWithRateConfig {
-  return parseOrThrow(
-    branchWithRateConfigSchema,
-    { id: row.id, orgId: row.org_id, name: row.name, createdAt: row.created_at, rateConfig: row.rate_config },
-    "branches",
-  );
-}
+export function toBranchView(row: Row): BranchWithRateConfig {}
 export function toRoomView(row: Row): RoomView {
   return parseOrThrow(
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 97ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 136ms

[Killed] ObjectLiteral
src/data-client.ts:62:5
 export function toBranchView(row: Row): BranchWithRateConfig {
   return parseOrThrow(
     branchWithRateConfigSchema,
-    { id: row.id, orgId: row.org_id, name: row.name, createdAt: row.created_at, rateConfig: row.rate_config },
+    {},
     "branches",
   );
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 103ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 100ms

[Killed] BlockStatement
src/data-client.ts:66:48
     "branches",
   );
 }
-export function toRoomView(row: Row): RoomView {
-  return parseOrThrow(
-    roomViewSchema,
-    { id: row.id, orgId: row.org_id, branchId: row.branch_id, roomNumber: row.room_number, status: row.status },
-    "rooms",
-  );
-}
+export function toRoomView(row: Row): RoomView {}
 export function toStaffView(row: Row): StaffView {
   return parseOrThrow(
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 106ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 111ms

[Killed] BlockStatement
src/data-client.ts:73:50
     "rooms",
   );
 }
-export function toStaffView(row: Row): StaffView {
-  return parseOrThrow(
-    staffViewSchema,
-    {
-      id: row.id,
-      orgId: row.org_id,
-      branchId: row.branch_id,
-      email: row.email,
-      role: row.role,
-      displayName: row.display_name,
-      isActive: row.is_active,
-    },
-    "staff",
-  );
-}
+export function toStaffView(row: Row): StaffView {}
 export function toSessionView(row: Row): SessionView {
   return parseOrThrow(
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 118ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 120ms

[Survived] StringLiteral
src/data-client.ts:85:5
       displayName: row.display_name,
       isActive: row.is_active,
     },
-    "staff",
+    "",
   );
 }

[Killed] BlockStatement
src/data-client.ts:88:54
     "staff",
   );
 }
-export function toSessionView(row: Row): SessionView {
-  return parseOrThrow(
-    sessionViewSchema,
-    {
-      id: row.id,
-      orgId: row.org_id,
-      branchId: row.branch_id,
-      roomId: row.room_id,
-      cashierId: row.cashier_id,
-      bookingType: row.booking_type,
-      pax: row.pax,
-      baseRate: row.base_rate,
-      surcharges: row.surcharges,
-      total: row.total,
-      checkedInAt: row.checked_in_at,
-      bookedEndAt: row.booked_end_at,
-      checkedOutAt: row.checked_out_at,
-      status: row.status,
-      voidReason: row.void_reason,
-    },
-    "sessions",
-  );
-}
+export function toSessionView(row: Row): SessionView {}
 
 export function toRateConfig(row: unknown): RateConfig {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 127ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 103ms

[Killed] BlockStatement
src/data-client.ts:112:56
   );
 }
 
-export function toRateConfig(row: unknown): RateConfig {
-  return parseOrThrow(rateConfigSchema, row, "branches.rate_config");
-}
+export function toRateConfig(row: unknown): RateConfig {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 104ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 133ms

[Killed] BlockStatement
src/data-client.ts:123:26
  */
 export function createSilidDataClient(client: SupabaseClient): SilidDataClient {
   return {
-    async listBranches() {
-      const { data, error } = await client.from("branches").select("*").order("name");
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return ((data ?? []) as Row[]).map(toBranchView);
-    },
+    async listBranches() {},
     async getBranch(branchId: string) {
       const { data, error } = await client.from("branches").select("*").eq("id", branchId).maybeSingle();
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 114ms

 ❯ test/data-client.test.ts (12 tests | 4 failed) 118ms

[Killed] ConditionalExpression
src/data-client.ts:125:11
   return {
     async listBranches() {
       const { data, error } = await client.from("branches").select("*").order("name");
-      if (error !== null) {
+      if (true) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 90ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 94ms

[Killed] EqualityOperator
src/data-client.ts:125:11
   return {
     async listBranches() {
       const { data, error } = await client.from("branches").select("*").order("name");
-      if (error !== null) {
+      if (error === null) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 131ms

 ❯ test/data-client.test.ts (12 tests | 4 failed) 127ms

[Killed] CallExpression
src/data-client.ts:126:9
     async listBranches() {
       const { data, error } = await client.from("branches").select("*").order("name");
       if (error !== null) {
-        throw new Error(error.message);
+        ;
       }
       return ((data ?? []) as Row[]).map(toBranchView);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 123ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 131ms

[Killed] BlockStatement
src/data-client.ts:130:39
       }
       return ((data ?? []) as Row[]).map(toBranchView);
     },
-    async getBranch(branchId: string) {
-      const { data, error } = await client.from("branches").select("*").eq("id", branchId).maybeSingle();
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return data === null ? null : toBranchView(data);
-    },
+    async getBranch(branchId: string) {},
     async listRooms(branchIds: string[]) {
       const { data, error } = await client
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 101ms

 ❯ test/data-client.test.ts (12 tests | 4 failed) 159ms

[Killed] ConditionalExpression
src/data-client.ts:132:11
     },
     async getBranch(branchId: string) {
       const { data, error } = await client.from("branches").select("*").eq("id", branchId).maybeSingle();
-      if (error !== null) {
+      if (false) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 104ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 114ms

[Killed] EqualityOperator
src/data-client.ts:132:11
     },
     async getBranch(branchId: string) {
       const { data, error } = await client.from("branches").select("*").eq("id", branchId).maybeSingle();
-      if (error !== null) {
+      if (error === null) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 109ms

 ❯ test/data-client.test.ts (12 tests | 4 failed) 119ms

[Killed] ConditionalExpression
src/data-client.ts:135:14
       if (error !== null) {
         throw new Error(error.message);
       }
-      return data === null ? null : toBranchView(data);
+      return true ? null : toBranchView(data);
     },
     async listRooms(branchIds: string[]) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 129ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 129ms

[Killed] EqualityOperator
src/data-client.ts:135:14
       if (error !== null) {
         throw new Error(error.message);
       }
-      return data === null ? null : toBranchView(data);
+      return data !== null ? null : toBranchView(data);
     },
     async listRooms(branchIds: string[]) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 96ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 132ms

[Killed] BlockStatement
src/data-client.ts:137:42
       }
       return data === null ? null : toBranchView(data);
     },
-    async listRooms(branchIds: string[]) {
-      const { data, error } = await client
-        .from("rooms")
-        .select("*")
-        .in("branch_id", branchIds)
-        .order("room_number");
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return ((data ?? []) as Row[]).map(toRoomView);
-    },
+    async listRooms(branchIds: string[]) {},
     async listStaff() {
       const { data, error } = await client.from("staff").select("*").order("display_name");
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 137ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 143ms

[Killed] ConditionalExpression
src/data-client.ts:143:11
         .select("*")
         .in("branch_id", branchIds)
         .order("room_number");
-      if (error !== null) {
+      if (true) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 107ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 98ms

[Killed] ConditionalExpression
src/data-client.ts:143:11
         .select("*")
         .in("branch_id", branchIds)
         .order("room_number");
-      if (error !== null) {
+      if (false) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 112ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 120ms

[Killed] BlockStatement
src/data-client.ts:148:23
       }
       return ((data ?? []) as Row[]).map(toRoomView);
     },
-    async listStaff() {
-      const { data, error } = await client.from("staff").select("*").order("display_name");
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return ((data ?? []) as Row[]).map(toStaffView);
-    },
+    async listStaff() {},
     async listSessions(branchIds: string[]) {
       const { data, error } = await client
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 100ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 130ms

[Survived] StringLiteral
src/data-client.ts:149:65
       return ((data ?? []) as Row[]).map(toRoomView);
     },
     async listStaff() {
-      const { data, error } = await client.from("staff").select("*").order("display_name");
+      const { data, error } = await client.from("staff").select("").order("display_name");
       if (error !== null) {
         throw new Error(error.message);

[Survived] StringLiteral
src/data-client.ts:149:76
       return ((data ?? []) as Row[]).map(toRoomView);
     },
     async listStaff() {
-      const { data, error } = await client.from("staff").select("*").order("display_name");
+      const { data, error } = await client.from("staff").select("*").order("");
       if (error !== null) {
         throw new Error(error.message);

[Killed] EqualityOperator
src/data-client.ts:150:11
     },
     async listStaff() {
       const { data, error } = await client.from("staff").select("*").order("display_name");
-      if (error !== null) {
+      if (error === null) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 100ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 124ms

[Killed] ConditionalExpression
src/data-client.ts:150:11
     },
     async listStaff() {
       const { data, error } = await client.from("staff").select("*").order("display_name");
-      if (error !== null) {
+      if (false) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 108ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 116ms

[Killed] BlockStatement
src/data-client.ts:155:45
       }
       return ((data ?? []) as Row[]).map(toStaffView);
     },
-    async listSessions(branchIds: string[]) {
-      const { data, error } = await client
-        .from("sessions")
-        .select("*")
-        .in("branch_id", branchIds)
-        .order("checked_in_at", { ascending: false });
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return ((data ?? []) as Row[]).map(toSessionView);
-    },
+    async listSessions(branchIds: string[]) {},
     async updateRateConfig(branchId, canteenOverrides, extensionOverrides) {
       const { data, error } = await client.rpc("update_rate_config", {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 124ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 125ms

[Survived] StringLiteral
src/data-client.ts:158:17
     async listSessions(branchIds: string[]) {
       const { data, error } = await client
         .from("sessions")
-        .select("*")
+        .select("")
         .in("branch_id", branchIds)
         .order("checked_in_at", { ascending: false });

[Killed] StringLiteral
src/data-client.ts:159:13
       const { data, error } = await client
         .from("sessions")
         .select("*")
-        .in("branch_id", branchIds)
+        .in("", branchIds)
         .order("checked_in_at", { ascending: false });
       if (error !== null) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 107ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 139ms

[Killed] BooleanLiteral
src/data-client.ts:160:46
         .from("sessions")
         .select("*")
         .in("branch_id", branchIds)
-        .order("checked_in_at", { ascending: false });
+        .order("checked_in_at", { ascending: true });
       if (error !== null) {
         throw new Error(error.message);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 96ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 144ms

[Killed] StringLiteral
src/data-client.ts:160:16
         .from("sessions")
         .select("*")
         .in("branch_id", branchIds)
-        .order("checked_in_at", { ascending: false });
+        .order("", { ascending: false });
       if (error !== null) {
         throw new Error(error.message);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 119ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 119ms

[Killed] BlockStatement
src/data-client.ts:161:27
         .select("*")
         .in("branch_id", branchIds)
         .order("checked_in_at", { ascending: false });
-      if (error !== null) {
-        throw new Error(error.message);
-      }
+      if (error !== null) {}
       return ((data ?? []) as Row[]).map(toSessionView);
     },
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 126ms

 ❯ test/data-client.test.ts (12 tests | 1 failed) 121ms

[Killed] ConditionalExpression
src/data-client.ts:161:11
         .select("*")
         .in("branch_id", branchIds)
         .order("checked_in_at", { ascending: false });
-      if (error !== null) {
+      if (true) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 111ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 108ms

[Killed] BlockStatement
src/data-client.ts:166:76
       }
       return ((data ?? []) as Row[]).map(toSessionView);
     },
-    async updateRateConfig(branchId, canteenOverrides, extensionOverrides) {
-      const { data, error } = await client.rpc("update_rate_config", {
-        row_branch_id: branchId,
-        canteen_overrides: canteenOverrides ?? {},
-        extension_overrides: extensionOverrides ?? {},
-      });
-      if (error !== null) {
-        throw new Error(error.message);
-      }
-      return toRateConfig(data);
-    },
+    async updateRateConfig(branchId, canteenOverrides, extensionOverrides) {},
   };
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 105ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 137ms

[Killed] LogicalOperator
src/data-client.ts:169:28
     async updateRateConfig(branchId, canteenOverrides, extensionOverrides) {
       const { data, error } = await client.rpc("update_rate_config", {
         row_branch_id: branchId,
-        canteen_overrides: canteenOverrides ?? {},
+        canteen_overrides: canteenOverrides && {},
         extension_overrides: extensionOverrides ?? {},
       });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 141ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 146ms

[Killed] LogicalOperator
src/data-client.ts:170:30
       const { data, error } = await client.rpc("update_rate_config", {
         row_branch_id: branchId,
         canteen_overrides: canteenOverrides ?? {},
-        extension_overrides: extensionOverrides ?? {},
+        extension_overrides: extensionOverrides && {},
       });
       if (error !== null) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 126ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 134ms

[Killed] ConditionalExpression
src/data-client.ts:172:11
         canteen_overrides: canteenOverrides ?? {},
         extension_overrides: extensionOverrides ?? {},
       });
-      if (error !== null) {
+      if (true) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 111ms

 ❯ test/data-client.test.ts (12 tests | 2 failed) 105ms

[Killed] EqualityOperator
src/data-client.ts:172:11
         canteen_overrides: canteenOverrides ?? {},
         extension_overrides: extensionOverrides ?? {},
       });
-      if (error !== null) {
+      if (error === null) {
         throw new Error(error.message);
       }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 123ms

 ❯ test/data-client.test.ts (12 tests | 3 failed) 140ms
