[Killed] BlockStatement
src/catalogue.ts:26:63
 }
 
 /** The catalogue default prices; a branch's stored overrides take precedence at the database. */
-export function defaultAddonCatalogue(): AddonCatalogueItem[] {
-  return Object.entries(ADDON_CATALOGUE).map(([id, price]) => ({
-    id,
-    price,
-    cashierPostable: id !== "extension_charge",
-  }));
-}
+export function defaultAddonCatalogue(): AddonCatalogueItem[] {}
 
 /** The full normalized canteen catalogue, ordered by the fixture's category order. */
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 2 failed | 1 skipped) 153ms

   ❯ defaultAddonCatalogue — served from the fixture (2)

[Killed] ArrowFunction
src/catalogue.ts:27:46
 
 /** The catalogue default prices; a branch's stored overrides take precedence at the database. */
 export function defaultAddonCatalogue(): AddonCatalogueItem[] {
-  return Object.entries(ADDON_CATALOGUE).map(([id, price]) => ({
-    id,
-    price,
-    cashierPostable: id !== "extension_charge",
-  }));
+  return Object.entries(ADDON_CATALOGUE).map(() => undefined);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 2 failed | 1 skipped) 131ms

   ❯ defaultAddonCatalogue — served from the fixture (2)

[Killed] ConditionalExpression
src/catalogue.ts:30:22
   return Object.entries(ADDON_CATALOGUE).map(([id, price]) => ({
     id,
     price,
-    cashierPostable: id !== "extension_charge",
+    cashierPostable: true,
   }));
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 197ms

   ❯ defaultAddonCatalogue — served from the fixture (2)

[Killed] ConditionalExpression
src/catalogue.ts:30:22
   return Object.entries(ADDON_CATALOGUE).map(([id, price]) => ({
     id,
     price,
-    cashierPostable: id !== "extension_charge",
+    cashierPostable: false,
   }));
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 151ms

   ❯ defaultAddonCatalogue — served from the fixture (2)

[Killed] BlockStatement
src/catalogue.ts:35:67
 }
 
 /** The full normalized canteen catalogue, ordered by the fixture's category order. */
-export function defaultCanteenCatalogue(): CanteenCatalogueItem[] {
-  const items = Object.entries(CANTEEN_CATALOGUE).map(([id, item]) => ({
-    id,
-    label: item.label,
-    price: item.price,
-    category: item.category,
-  }));
-  return items.sort(
-    (a, b) =>
-      CANTEEN_CATEGORY_ORDER.indexOf(a.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) -
-        CANTEEN_CATEGORY_ORDER.indexOf(b.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) ||
-      a.label.localeCompare(b.label),
-  );
-}
+export function defaultCanteenCatalogue(): CanteenCatalogueItem[] {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 2 failed | 1 skipped) 46ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] ArrowFunction
src/catalogue.ts:36:55
 
 /** The full normalized canteen catalogue, ordered by the fixture's category order. */
 export function defaultCanteenCatalogue(): CanteenCatalogueItem[] {
-  const items = Object.entries(CANTEEN_CATALOGUE).map(([id, item]) => ({
-    id,
-    label: item.label,
-    price: item.price,
-    category: item.category,
-  }));
+  const items = Object.entries(CANTEEN_CATALOGUE).map(() => undefined);
   return items.sort(
     (a, b) =>
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 2 failed | 1 skipped) 39ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] ObjectLiteral
src/catalogue.ts:36:72
 
 /** The full normalized canteen catalogue, ordered by the fixture's category order. */
 export function defaultCanteenCatalogue(): CanteenCatalogueItem[] {
-  const items = Object.entries(CANTEEN_CATALOGUE).map(([id, item]) => ({
-    id,
-    label: item.label,
-    price: item.price,
-    category: item.category,
-  }));
+  const items = Object.entries(CANTEEN_CATALOGUE).map(([id, item]) => ({}));
   return items.sort(
     (a, b) =>
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 2 failed | 1 skipped) 42ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] MethodExpression
src/catalogue.ts:42:10
     price: item.price,
     category: item.category,
   }));
-  return items.sort(
-    (a, b) =>
-      CANTEEN_CATEGORY_ORDER.indexOf(a.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) -
-        CANTEEN_CATEGORY_ORDER.indexOf(b.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) ||
-      a.label.localeCompare(b.label),
-  );
+  return items;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 212ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] ArrowFunction
src/catalogue.ts:43:5
     category: item.category,
   }));
   return items.sort(
-    (a, b) =>
-      CANTEEN_CATEGORY_ORDER.indexOf(a.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) -
-        CANTEEN_CATEGORY_ORDER.indexOf(b.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) ||
-      a.label.localeCompare(b.label),
+    () => undefined,
   );
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 137ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] ConditionalExpression
src/catalogue.ts:44:7
   }));
   return items.sort(
     (a, b) =>
-      CANTEEN_CATEGORY_ORDER.indexOf(a.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) -
-        CANTEEN_CATEGORY_ORDER.indexOf(b.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) ||
-      a.label.localeCompare(b.label),
+      true,
   );
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 154ms

   ✓ defaultAddonCatalogue — served from the fixture (2)

[Killed] ArithmeticOperator
src/catalogue.ts:44:7
   }));
   return items.sort(
     (a, b) =>
-      CANTEEN_CATEGORY_ORDER.indexOf(a.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) -
-        CANTEEN_CATEGORY_ORDER.indexOf(b.category as (typeof CANTEEN_CATEGORY_ORDER)[number]) ||
+      CANTEEN_CATEGORY_ORDER.indexOf(a.category as typeof CANTEEN_CATEGORY_ORDER[number]) + CANTEEN_CATEGORY_ORDER.indexOf(b.category as typeof CANTEEN_CATEGORY_ORDER[number]) ||
       a.label.localeCompare(b.label),
   );
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ❯ test/catalogue.test.ts (6 tests | 1 failed | 1 skipped) 176ms

   ✓ defaultAddonCatalogue — served from the fixture (2)
