[Killed] BlockStatement
src/index.ts:47:60
 export function createTestCaller(
   caller: Caller | null,
   data: SilidDataClient,
-): ReturnType<ReturnType<typeof createSilidCallerFactory>> {
-  return createSilidCallerFactory(appRouter)({ caller, data });
-}
+): ReturnType<ReturnType<typeof createSilidCallerFactory>> {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 140ms

 ✓ test/data-client.test.ts (12 tests) 118ms
