[Killed] ObjectLiteral
src/routers/branches.router.ts:11:43
 import { z } from "zod";
 import { protectedProcedure, trpc } from "../trpc";
 
-export const branchesRouter = trpc.router({
-  listBranches: protectedProcedure.input(z.void()).query(async ({ ctx }) => {
-    return ctx.data.listBranches();
-  }),
-});
+export const branchesRouter = trpc.router({});
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 100ms

 ✓ test/data-client.test.ts (12 tests) 100ms

[Killed] BlockStatement
src/routers/branches.router.ts:12:77
 import { protectedProcedure, trpc } from "../trpc";
 
 export const branchesRouter = trpc.router({
-  listBranches: protectedProcedure.input(z.void()).query(async ({ ctx }) => {
-    return ctx.data.listBranches();
-  }),
+  listBranches: protectedProcedure.input(z.void()).query(async ({ ctx }) => {}),
 });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 108ms

 ✓ test/data-client.test.ts (12 tests) 107ms
