[Survived] BlockStatement
src/routers/catalogue.router.ts:13:71
 import { defaultAddonCatalogue, defaultCanteenCatalogue } from "../catalogue";
 
 export const catalogueRouter = trpc.router({
-  getDefaultCatalogue: protectedProcedure.input(z.void()).query(() => {
-    return {
-      addons: defaultAddonCatalogue(),
-      canteen: defaultCanteenCatalogue(),
-      currency: "PHP" as const,
-    };
-  }),
+  getDefaultCatalogue: protectedProcedure.input(z.void()).query(() => {}),
 });
 
