[Killed] BlockStatement
src/routers/rates.router.ts:27:20
   caller: Caller,
   branchId: string,
   data: Pick<SilidDataClient, "getBranch">,
-): Promise<string> {
-  const decision = resolveBranchFilter(caller, branchId);
-  return assertTargetInScope(decision, await data.getBranch(branchId));
-}
+): Promise<string> {}
 
 export const ratesRouter = trpc.router({
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 95ms

 ✓ test/data-client.test.ts (12 tests) 107ms

[Killed] BlockStatement
src/routers/rates.router.ts:34:97
 
 export const ratesRouter = trpc.router({
   /** Read the branch's stored rate card (unknown keys preserved, vault-20). */
-  getRateConfig: orgAdminProcedure.input(rateConfigTargetInput).query(async ({ ctx, input }) => {
-    const branchId = await verifiedBranchId(ctx.caller, input.branchId, ctx.data);
-    return ctx.data.getBranch(branchId);
-  }),
+  getRateConfig: orgAdminProcedure.input(rateConfigTargetInput).query(async ({ ctx, input }) => {}),
 
   /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 103ms

 ✓ test/data-client.test.ts (12 tests) 95ms

[Killed] BlockStatement
src/routers/rates.router.ts:45:109
    * (spec/data-model.md §2), with actor and time sealed from the caller's
    * verified claims — no client input participates.
    */
-  updateRateConfig: orgAdminProcedure.input(updateRateConfigInputSchema).mutation(async ({ ctx, input }) => {
-    const branchId = await verifiedBranchId(ctx.caller, input.branchId, ctx.data);
-    return toRateConfig(
-      await ctx.data.updateRateConfig(branchId, input.canteenOverrides, input.extensionOverrides),
-    );
-  }),
+  updateRateConfig: orgAdminProcedure.input(updateRateConfigInputSchema).mutation(async ({ ctx, input }) => {}),
 });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 129ms

 ✓ test/data-client.test.ts (12 tests) 87ms
