[Killed] ObjectLiteral
src/routers/rooms.router.ts:14:40
 
 const branchSelectorInput = z.strictObject({ branchId: z.uuid().optional() });
 
-export const roomsRouter = trpc.router({
-  listRooms: protectedProcedure.input(branchSelectorInput).query(async ({ ctx, input }) => {
-    const decision = resolveBranchFilter(ctx.caller, input.branchId);
-    return ctx.data.listRooms(await resolveBranchIds(ctx.caller, ctx.data, decision));
-  }),
-});
+export const roomsRouter = trpc.router({});
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 109ms

 ✓ test/data-client.test.ts (12 tests) 101ms

[Killed] BlockStatement
src/routers/rooms.router.ts:15:92
 const branchSelectorInput = z.strictObject({ branchId: z.uuid().optional() });
 
 export const roomsRouter = trpc.router({
-  listRooms: protectedProcedure.input(branchSelectorInput).query(async ({ ctx, input }) => {
-    const decision = resolveBranchFilter(ctx.caller, input.branchId);
-    return ctx.data.listRooms(await resolveBranchIds(ctx.caller, ctx.data, decision));
-  }),
+  listRooms: protectedProcedure.input(branchSelectorInput).query(async ({ ctx, input }) => {}),
 });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 117ms

 ✓ test/data-client.test.ts (12 tests) 92ms
