[Killed] BlockStatement
src/routers/sessions.router.ts:14:95
 const branchSelectorInput = z.strictObject({ branchId: z.uuid().optional() });
 
 export const sessionsRouter = trpc.router({
-  listSessions: protectedProcedure.input(branchSelectorInput).query(async ({ ctx, input }) => {
-    const decision = resolveBranchFilter(ctx.caller, input.branchId);
-    return ctx.data.listSessions(await resolveBranchIds(ctx.caller, ctx.data, decision));
-  }),
+  listSessions: protectedProcedure.input(branchSelectorInput).query(async ({ ctx, input }) => {}),
 });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 138ms

 ✓ test/data-client.test.ts (12 tests) 119ms
