[Killed] ObjectLiteral
src/routers/staff.router.ts:11:40
 import { z } from "zod";
 import { protectedProcedure, trpc } from "../trpc";
 
-export const staffRouter = trpc.router({
-  listStaff: protectedProcedure.input(z.void()).query(async ({ ctx }) => {
-    return ctx.data.listStaff();
-  }),
-});
+export const staffRouter = trpc.router({});
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 120ms

 ✓ test/data-client.test.ts (12 tests) 100ms

[Killed] BlockStatement
src/routers/staff.router.ts:12:74
 import { protectedProcedure, trpc } from "../trpc";
 
 export const staffRouter = trpc.router({
-  listStaff: protectedProcedure.input(z.void()).query(async ({ ctx }) => {
-    return ctx.data.listStaff();
-  }),
+  listStaff: protectedProcedure.input(z.void()).query(async ({ ctx }) => {}),
 });
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 123ms

 ✓ test/data-client.test.ts (12 tests) 89ms
