[Killed] ConditionalExpression
src/scope.ts:37:7
  * never served the requested rows.
  */
 export function resolveBranchFilter(caller: Caller | null, requestedBranchId?: string): BranchScopeDecision {
-  if (caller === null) {
+  if (false) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 397ms

 ✓ test/data-client.test.ts (12 tests) 634ms

[Killed] ConditionalExpression
src/scope.ts:37:7
  * never served the requested rows.
  */
 export function resolveBranchFilter(caller: Caller | null, requestedBranchId?: string): BranchScopeDecision {
-  if (caller === null) {
+  if (true) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 143ms

 ✓ test/data-client.test.ts (12 tests) 92ms

[Killed] ObjectLiteral
src/scope.ts:38:25
  */
 export function resolveBranchFilter(caller: Caller | null, requestedBranchId?: string): BranchScopeDecision {
   if (caller === null) {
-    throw new TRPCError({ code: "UNAUTHORIZED" });
+    throw new TRPCError({});
   }
   const { claims } = caller;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 113ms

 ✓ test/data-client.test.ts (12 tests) 161ms

[Killed] ConditionalExpression
src/scope.ts:42:7
   }
   const { claims } = caller;
 
-  if (claims.role === "cashier") {
+  if (false) {
     if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
       return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 115ms

 ✓ test/data-client.test.ts (12 tests) 100ms

[Killed] BlockStatement
src/scope.ts:42:34
   }
   const { claims } = caller;
 
-  if (claims.role === "cashier") {
-    if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
-      return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
-    }
-    throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
-  }
+  if (claims.role === "cashier") {}
 
   if (claims.role === "org_admin") {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z


 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 155ms

 ✓ test/data-client.test.ts (12 tests) 211ms

 ✓ test/context.test.ts (6 tests) 74ms

[Killed] BlockStatement
src/scope.ts:43:84
   const { claims } = caller;
 
   if (claims.role === "cashier") {
-    if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
-      return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
-    }
+    if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {}
     throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 117ms

 ✓ test/data-client.test.ts (12 tests) 149ms

[Killed] EqualityOperator
src/scope.ts:43:9
   const { claims } = caller;
 
   if (claims.role === "cashier") {
-    if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
+    if (requestedBranchId !== undefined || requestedBranchId === claims.branch_id) {
       return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
     }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 149ms

 ✓ test/data-client.test.ts (12 tests) 157ms

[Killed] ObjectLiteral
src/scope.ts:44:14
 
   if (claims.role === "cashier") {
     if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
-      return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
+      return {};
     }
     throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 173ms

 ✓ test/data-client.test.ts (12 tests) 87ms

[Killed] ObjectLiteral
src/scope.ts:46:25
     if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
       return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
     }
-    throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
+    throw new TRPCError({});
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 137ms

 ✓ test/data-client.test.ts (12 tests) 90ms

[Killed] StringLiteral
src/scope.ts:46:33
     if (requestedBranchId === undefined || requestedBranchId === claims.branch_id) {
       return { kind: "branch", orgId: claims.org_id as string, branchId: claims.branch_id as string };
     }
-    throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
+    throw new TRPCError({ code: "", message: "scope comes from the session claims, not the request" });
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 126ms

 ✓ test/data-client.test.ts (12 tests) 87ms

[Killed] ConditionalExpression
src/scope.ts:49:7
     throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
   }
 
-  if (claims.role === "org_admin") {
+  if (false) {
     if (requestedBranchId === undefined) {
       return { kind: "org", orgId: claims.org_id as string };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 109ms

 ✓ test/data-client.test.ts (12 tests) 146ms

[Killed] EqualityOperator
src/scope.ts:49:7
     throw new TRPCError({ code: "FORBIDDEN", message: "scope comes from the session claims, not the request" });
   }
 
-  if (claims.role === "org_admin") {
+  if (claims.role !== "org_admin") {
     if (requestedBranchId === undefined) {
       return { kind: "org", orgId: claims.org_id as string };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 168ms

 ✓ test/data-client.test.ts (12 tests) 163ms

[Killed] EqualityOperator
src/scope.ts:50:9
   }
 
   if (claims.role === "org_admin") {
-    if (requestedBranchId === undefined) {
+    if (requestedBranchId !== undefined) {
       return { kind: "org", orgId: claims.org_id as string };
     }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 160ms

 ✓ test/data-client.test.ts (12 tests) 110ms

[Killed] ConditionalExpression
src/scope.ts:50:9
   }
 
   if (claims.role === "org_admin") {
-    if (requestedBranchId === undefined) {
+    if (true) {
       return { kind: "org", orgId: claims.org_id as string };
     }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 112ms

 ✓ test/data-client.test.ts (12 tests) 115ms

[Killed] StringLiteral
src/scope.ts:53:20
     if (requestedBranchId === undefined) {
       return { kind: "org", orgId: claims.org_id as string };
     }
-    return { kind: "target", orgId: claims.org_id, branchId: requestedBranchId };
+    return { kind: "", orgId: claims.org_id, branchId: requestedBranchId };
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 123ms

 ✓ test/data-client.test.ts (12 tests) 114ms

[Killed] ObjectLiteral
src/scope.ts:53:12
     if (requestedBranchId === undefined) {
       return { kind: "org", orgId: claims.org_id as string };
     }
-    return { kind: "target", orgId: claims.org_id, branchId: requestedBranchId };
+    return {};
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 129ms

 ✓ test/data-client.test.ts (12 tests) 130ms

[Killed] ConditionalExpression
src/scope.ts:58:7
 
   // platform_admin: reaches all organizations by design, through
   // server-side paths; a named branch is verified for visibility.
-  if (requestedBranchId === undefined) {
+  if (false) {
     return { kind: "platform" };
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 117ms

 ✓ test/data-client.test.ts (12 tests) 110ms

[Killed] ConditionalExpression
src/scope.ts:58:7
 
   // platform_admin: reaches all organizations by design, through
   // server-side paths; a named branch is verified for visibility.
-  if (requestedBranchId === undefined) {
+  if (true) {
     return { kind: "platform" };
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 108ms

 ✓ test/data-client.test.ts (12 tests) 115ms

[Killed] BlockStatement
src/scope.ts:73:11
 export function assertTargetInScope(
   decision: BranchScopeDecision,
   branch: { orgId: string } | null,
-): string {
-  if (decision.kind !== "target") {
-    throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
-  }
-  if (branch === null) {
-    throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
-  }
-  if (decision.orgId !== null && branch.orgId !== decision.orgId) {
-    throw new TRPCError({ code: "FORBIDDEN", message: "branch belongs to another organization" });
-  }
-  return decision.branchId;
-}
+): string {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 120ms

 ✓ test/data-client.test.ts (12 tests) 84ms

[Killed] EqualityOperator
src/scope.ts:74:7
   decision: BranchScopeDecision,
   branch: { orgId: string } | null,
 ): string {
-  if (decision.kind !== "target") {
+  if (decision.kind === "target") {
     throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 107ms

 ✓ test/data-client.test.ts (12 tests) 106ms

[Killed] ConditionalExpression
src/scope.ts:74:7
   decision: BranchScopeDecision,
   branch: { orgId: string } | null,
 ): string {
-  if (decision.kind !== "target") {
+  if (false) {
     throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 112ms

 ✓ test/data-client.test.ts (12 tests) 112ms

[Killed] ObjectLiteral
src/scope.ts:75:25
   branch: { orgId: string } | null,
 ): string {
   if (decision.kind !== "target") {
-    throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
+    throw new TRPCError({});
   }
   if (branch === null) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 110ms

 ✓ test/data-client.test.ts (12 tests) 104ms

[Killed] EqualityOperator
src/scope.ts:77:7
   if (decision.kind !== "target") {
     throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
   }
-  if (branch === null) {
+  if (branch !== null) {
     throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 137ms

 ✓ test/data-client.test.ts (12 tests) 95ms

[Killed] ConditionalExpression
src/scope.ts:77:7
   if (decision.kind !== "target") {
     throw new TRPCError({ code: "INTERNAL_SERVER_ERROR", message: "no target to verify" });
   }
-  if (branch === null) {
+  if (true) {
     throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 99ms

 ✓ test/data-client.test.ts (12 tests) 91ms

[Killed] EqualityOperator
src/scope.ts:80:7
   if (branch === null) {
     throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
   }
-  if (decision.orgId !== null && branch.orgId !== decision.orgId) {
+  if (decision.orgId === null && branch.orgId !== decision.orgId) {
     throw new TRPCError({ code: "FORBIDDEN", message: "branch belongs to another organization" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 118ms

 ✓ test/data-client.test.ts (12 tests) 88ms

[Killed] ConditionalExpression
src/scope.ts:80:7
   if (branch === null) {
     throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
   }
-  if (decision.orgId !== null && branch.orgId !== decision.orgId) {
+  if (true) {
     throw new TRPCError({ code: "FORBIDDEN", message: "branch belongs to another organization" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 129ms

 ✓ test/data-client.test.ts (12 tests) 85ms

[Killed] ObjectLiteral
src/scope.ts:81:25
     throw new TRPCError({ code: "NOT_FOUND", message: "branch not found in the caller's scope" });
   }
   if (decision.orgId !== null && branch.orgId !== decision.orgId) {
-    throw new TRPCError({ code: "FORBIDDEN", message: "branch belongs to another organization" });
+    throw new TRPCError({});
   }
   return decision.branchId;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 137ms

 ✓ test/data-client.test.ts (12 tests) 85ms
