[Killed] BlockStatement
src/trpc.ts:18:53
 export const trpc = initTRPC.context<TrpcContextShape>().create();
 
 /** Requires a verified session and the as-caller data client. */
-const enforced = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
-    throw new TRPCError({ code: "UNAUTHORIZED" });
-  }
-  return next({ ctx: { caller: ctx.caller, data: ctx.data } });
-});
+const enforced = trpc.middleware(({ ctx, next }) => {});
 
 export const protectedProcedure = trpc.procedure.use(enforced);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 115ms

 ✓ test/data-client.test.ts (12 tests) 96ms

[Killed] LogicalOperator
src/trpc.ts:19:7
 
 /** Requires a verified session and the as-caller data client. */
 const enforced = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
+  if (ctx.caller === null && ctx.data === null) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 124ms

 ✓ test/data-client.test.ts (12 tests) 85ms

[Killed] EqualityOperator
src/trpc.ts:19:30
 
 /** Requires a verified session and the as-caller data client. */
 const enforced = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
+  if (ctx.caller === null || ctx.data !== null) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 111ms

 ✓ test/data-client.test.ts (12 tests) 100ms

[Killed] BlockStatement
src/trpc.ts:28:57
 export const protectedProcedure = trpc.procedure.use(enforced);
 
 /** Organization-tier surfaces (rate configuration, org management reads). */
-const orgAdminOnly = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
-    throw new TRPCError({ code: "UNAUTHORIZED" });
-  }
-  if (ctx.caller.claims.role !== "org_admin") {
-    throw new TRPCError({ code: "FORBIDDEN", message: "this surface belongs to the organization tier" });
-  }
-  return next({ ctx: { caller: ctx.caller, data: ctx.data } });
-});
+const orgAdminOnly = trpc.middleware(({ ctx, next }) => {});
 
 export const orgAdminProcedure = protectedProcedure.use(orgAdminOnly);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 140ms

 ✓ test/data-client.test.ts (12 tests) 90ms

[Killed] EqualityOperator
src/trpc.ts:29:30
 
 /** Organization-tier surfaces (rate configuration, org management reads). */
 const orgAdminOnly = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
+  if (ctx.caller === null || ctx.data !== null) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 130ms

 ✓ test/data-client.test.ts (12 tests) 91ms

[Killed] ConditionalExpression
src/trpc.ts:29:7
 
 /** Organization-tier surfaces (rate configuration, org management reads). */
 const orgAdminOnly = trpc.middleware(({ ctx, next }) => {
-  if (ctx.caller === null || ctx.data === null) {
+  if (true) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 125ms

 ✓ test/data-client.test.ts (12 tests) 84ms

[Survived] ObjectLiteral
src/trpc.ts:30:25
 /** Organization-tier surfaces (rate configuration, org management reads). */
 const orgAdminOnly = trpc.middleware(({ ctx, next }) => {
   if (ctx.caller === null || ctx.data === null) {
-    throw new TRPCError({ code: "UNAUTHORIZED" });
+    throw new TRPCError({});
   }
   if (ctx.caller.claims.role !== "org_admin") {

[Killed] BlockStatement
src/trpc.ts:32:47
   if (ctx.caller === null || ctx.data === null) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
-  if (ctx.caller.claims.role !== "org_admin") {
-    throw new TRPCError({ code: "FORBIDDEN", message: "this surface belongs to the organization tier" });
-  }
+  if (ctx.caller.claims.role !== "org_admin") {}
   return next({ ctx: { caller: ctx.caller, data: ctx.data } });
 });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 96ms

 ✓ test/data-client.test.ts (12 tests) 93ms

[Killed] EqualityOperator
src/trpc.ts:32:7
   if (ctx.caller === null || ctx.data === null) {
     throw new TRPCError({ code: "UNAUTHORIZED" });
   }
-  if (ctx.caller.claims.role !== "org_admin") {
+  if (ctx.caller.claims.role === "org_admin") {
     throw new TRPCError({ code: "FORBIDDEN", message: "this surface belongs to the organization tier" });
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/api/.stryker-tmp/sandbox-RuxJ6Z



 ✓ test/catalogue.test.ts (6 tests | 1 skipped) 101ms

 ✓ test/data-client.test.ts (12 tests) 88ms

[Survived] ObjectLiteral
src/trpc.ts:35:15
   if (ctx.caller.claims.role !== "org_admin") {
     throw new TRPCError({ code: "FORBIDDEN", message: "this surface belongs to the organization tier" });
   }
-  return next({ ctx: { caller: ctx.caller, data: ctx.data } });
+  return next({});
 });
 
