[Killed] StringLiteral
src/drizzle/schema.ts:26:3
 } from "drizzle-orm/pg-core";
 
 export const organizations = pgTable(
-  "organizations",
+  "",
   {
     id: uuid("id").primaryKey().defaultRandom(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 195ms

 ✓ test/smoke.test.ts (1 test) 79ms

[Survived] StringLiteral
src/drizzle/schema.ts:29:16
   "organizations",
   {
     id: uuid("id").primaryKey().defaultRandom(),
-    name: text("name").notNull(),
+    name: text("").notNull(),
     status: text("status").notNull().default("active"),
     planStatus: text("plan_status").notNull().default("reserved"),

[Killed] StringLiteral
src/drizzle/schema.ts:31:22
     id: uuid("id").primaryKey().defaultRandom(),
     name: text("name").notNull(),
     status: text("status").notNull().default("active"),
-    planStatus: text("plan_status").notNull().default("reserved"),
+    planStatus: text("").notNull().default("reserved"),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 59ms

 ✓ test/money-reference.test.ts (9 tests) 86ms

[Timeout] BooleanLiteral
src/drizzle/schema.ts:32:56
     name: text("name").notNull(),
     status: text("status").notNull().default("active"),
     planStatus: text("plan_status").notNull().default("reserved"),
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] StringLiteral
src/drizzle/schema.ts:32:26
     name: text("name").notNull(),
     status: text("status").notNull().default("active"),
     planStatus: text("plan_status").notNull().default("reserved"),
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] ArrowFunction
src/drizzle/schema.ts:34:3
     planStatus: text("plan_status").notNull().default("reserved"),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    check("organizations_status_check", sql`status in ('active', 'suspended')`),
-  ],
+  () => undefined,
 );
 

[Timeout] ArrayDeclaration
src/drizzle/schema.ts:34:14
     planStatus: text("plan_status").notNull().default("reserved"),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    check("organizations_status_check", sql`status in ('active', 'suspended')`),
-  ],
+  (table) => [],
 );
 

[Survived] StringLiteral
src/drizzle/schema.ts:35:44
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => [
-    check("organizations_status_check", sql`status in ('active', 'suspended')`),
+    check("organizations_status_check", sql``),
   ],
 );

[Timeout] StringLiteral
src/drizzle/schema.ts:35:11
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => [
-    check("organizations_status_check", sql`status in ('active', 'suspended')`),
+    check("", sql`status in ('active', 'suspended')`),
   ],
 );

[Killed] StringLiteral
src/drizzle/schema.ts:40:3
 );
 
 export const branches = pgTable(
-  "branches",
+  "",
   {
     id: uuid("id").primaryKey().defaultRandom(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 44ms

 ✓ test/money-reference.test.ts (9 tests) 100ms

[Survived] ArrowFunction
src/drizzle/schema.ts:45:19
     id: uuid("id").primaryKey().defaultRandom(),
     orgId: uuid("org_id")
       .notNull()
-      .references(() => organizations.id),
+      .references(() => undefined),
     name: text("name").notNull(),
     rateConfig: jsonb("rate_config")

[Timeout] BooleanLiteral
src/drizzle/schema.ts:50:56
     rateConfig: jsonb("rate_config")
       .notNull()
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => [index("branches_org_id_idx").on(table.orgId)],

[Timeout] ObjectLiteral
src/drizzle/schema.ts:50:40
     rateConfig: jsonb("rate_config")
       .notNull()
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", {}).notNull().defaultNow(),
   },
   (table) => [index("branches_org_id_idx").on(table.orgId)],

[Timeout] ArrowFunction
src/drizzle/schema.ts:52:3
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [index("branches_org_id_idx").on(table.orgId)],
+  () => undefined,
 );
 

[Killed] StringLiteral
src/drizzle/schema.ts:52:21
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [index("branches_org_id_idx").on(table.orgId)],
+  (table) => [index("").on(table.orgId)],
 );
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 14ms

 ✓ test/money-reference.test.ts (9 tests) 40ms

[Killed] StringLiteral
src/drizzle/schema.ts:56:3
 );
 
 export const staff = pgTable(
-  "staff",
+  "",
   {
     id: uuid("id").primaryKey(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 13ms

 ✓ test/money-reference.test.ts (9 tests) 36ms

[Survived] ArrowFunction
src/drizzle/schema.ts:62:44
     orgId: uuid("org_id")
       .notNull()
       .references(() => organizations.id),
-    branchId: uuid("branch_id").references(() => branches.id),
+    branchId: uuid("branch_id").references(() => undefined),
     email: text("email").notNull(),
     role: text("role").notNull(),

[Timeout] StringLiteral
src/drizzle/schema.ts:62:20
     orgId: uuid("org_id")
       .notNull()
       .references(() => organizations.id),
-    branchId: uuid("branch_id").references(() => branches.id),
+    branchId: uuid("").references(() => branches.id),
     email: text("email").notNull(),
     role: text("role").notNull(),

[Survived] StringLiteral
src/drizzle/schema.ts:64:16
       .references(() => organizations.id),
     branchId: uuid("branch_id").references(() => branches.id),
     email: text("email").notNull(),
-    role: text("role").notNull(),
+    role: text("").notNull(),
     displayName: text("display_name").notNull(),
     isActive: boolean("is_active").notNull().default(true),

[Survived] BooleanLiteral
src/drizzle/schema.ts:66:54
     email: text("email").notNull(),
     role: text("role").notNull(),
     displayName: text("display_name").notNull(),
-    isActive: boolean("is_active").notNull().default(true),
+    isActive: boolean("is_active").notNull().default(false),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },

[Timeout] BooleanLiteral
src/drizzle/schema.ts:67:56
     role: text("role").notNull(),
     displayName: text("display_name").notNull(),
     isActive: boolean("is_active").notNull().default(true),
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] ArrowFunction
src/drizzle/schema.ts:69:3
     isActive: boolean("is_active").notNull().default(true),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    index("staff_org_id_idx").on(table.orgId),
-    index("staff_branch_id_idx").on(table.branchId),
-    uniqueIndex("staff_org_email_uniq").on(table.orgId, table.email),
-    check("staff_role_check", sql`role in ('cashier', 'org_admin', 'platform_admin')`),
-    check(
-      "staff_role_branch_shape",
-      sql`(role = 'cashier' and branch_id is not null) or (role <> 'cashier' and branch_id is null)`,
-    ),
-  ],
+  () => undefined,
 );
 

[Timeout] StringLiteral
src/drizzle/schema.ts:73:11
     index("staff_org_id_idx").on(table.orgId),
     index("staff_branch_id_idx").on(table.branchId),
     uniqueIndex("staff_org_email_uniq").on(table.orgId, table.email),
-    check("staff_role_check", sql`role in ('cashier', 'org_admin', 'platform_admin')`),
+    check("", sql`role in ('cashier', 'org_admin', 'platform_admin')`),
     check(
       "staff_role_branch_shape",

[Timeout] StringLiteral
src/drizzle/schema.ts:75:7
     uniqueIndex("staff_org_email_uniq").on(table.orgId, table.email),
     check("staff_role_check", sql`role in ('cashier', 'org_admin', 'platform_admin')`),
     check(
-      "staff_role_branch_shape",
+      "",
       sql`(role = 'cashier' and branch_id is not null) or (role <> 'cashier' and branch_id is null)`,
     ),

[Timeout] StringLiteral
src/drizzle/schema.ts:76:10
     check("staff_role_check", sql`role in ('cashier', 'org_admin', 'platform_admin')`),
     check(
       "staff_role_branch_shape",
-      sql`(role = 'cashier' and branch_id is not null) or (role <> 'cashier' and branch_id is null)`,
+      sql``,
     ),
   ],

[Timeout] StringLiteral
src/drizzle/schema.ts:85:17
   "rooms",
   {
     id: uuid("id").primaryKey().defaultRandom(),
-    orgId: uuid("org_id")
+    orgId: uuid("")
       .notNull()
       .references(() => organizations.id),

[Timeout] StringLiteral
src/drizzle/schema.ts:88:20
     orgId: uuid("org_id")
       .notNull()
       .references(() => organizations.id),
-    branchId: uuid("branch_id")
+    branchId: uuid("")
       .notNull()
       .references(() => branches.id),

[Timeout] ArrowFunction
src/drizzle/schema.ts:90:19
       .references(() => organizations.id),
     branchId: uuid("branch_id")
       .notNull()
-      .references(() => branches.id),
+      .references(() => undefined),
     roomNumber: text("room_number").notNull(),
     status: text("status").notNull().default("vacant"),

[Timeout] StringLiteral
src/drizzle/schema.ts:92:46
       .notNull()
       .references(() => branches.id),
     roomNumber: text("room_number").notNull(),
-    status: text("status").notNull().default("vacant"),
+    status: text("status").notNull().default(""),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },

[Timeout] BooleanLiteral
src/drizzle/schema.ts:93:56
       .references(() => branches.id),
     roomNumber: text("room_number").notNull(),
     status: text("status").notNull().default("vacant"),
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] ObjectLiteral
src/drizzle/schema.ts:93:40
       .references(() => branches.id),
     roomNumber: text("room_number").notNull(),
     status: text("status").notNull().default("vacant"),
-    createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
+    createdAt: timestamp("created_at", {}).notNull().defaultNow(),
   },
   (table) => [

[Timeout] ArrowFunction
src/drizzle/schema.ts:95:3
     status: text("status").notNull().default("vacant"),
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    index("rooms_org_id_idx").on(table.orgId),
-    index("rooms_branch_id_idx").on(table.branchId),
-    uniqueIndex("rooms_branch_room_number_uniq").on(table.branchId, table.roomNumber),
-    check("rooms_status_check", sql`status in ('vacant', 'occupied', 'grace', 'overdue')`),
-  ],
+  () => undefined,
 );
 

[Timeout] StringLiteral
src/drizzle/schema.ts:96:11
     createdAt: timestamp("created_at", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => [
-    index("rooms_org_id_idx").on(table.orgId),
+    index("").on(table.orgId),
     index("rooms_branch_id_idx").on(table.branchId),
     uniqueIndex("rooms_branch_room_number_uniq").on(table.branchId, table.roomNumber),

[Timeout] StringLiteral
src/drizzle/schema.ts:98:17
   (table) => [
     index("rooms_org_id_idx").on(table.orgId),
     index("rooms_branch_id_idx").on(table.branchId),
-    uniqueIndex("rooms_branch_room_number_uniq").on(table.branchId, table.roomNumber),
+    uniqueIndex("").on(table.branchId, table.roomNumber),
     check("rooms_status_check", sql`status in ('vacant', 'occupied', 'grace', 'overdue')`),
   ],

[Timeout] StringLiteral
src/drizzle/schema.ts:99:11
     index("rooms_org_id_idx").on(table.orgId),
     index("rooms_branch_id_idx").on(table.branchId),
     uniqueIndex("rooms_branch_room_number_uniq").on(table.branchId, table.roomNumber),
-    check("rooms_status_check", sql`status in ('vacant', 'occupied', 'grace', 'overdue')`),
+    check("", sql`status in ('vacant', 'occupied', 'grace', 'overdue')`),
   ],
 );

[Survived] ArrowFunction
src/drizzle/schema.ts:115:19
       .references(() => branches.id),
     roomId: uuid("room_id")
       .notNull()
-      .references(() => rooms.id),
+      .references(() => undefined),
     cashierId: uuid("cashier_id")
       .notNull()

[Timeout] StringLiteral
src/drizzle/schema.ts:116:21
     roomId: uuid("room_id")
       .notNull()
       .references(() => rooms.id),
-    cashierId: uuid("cashier_id")
+    cashierId: uuid("")
       .notNull()
       .references(() => staff.id),

[Timeout] ArrowFunction
src/drizzle/schema.ts:118:19
       .references(() => rooms.id),
     cashierId: uuid("cashier_id")
       .notNull()
-      .references(() => staff.id),
+      .references(() => undefined),
     bookingType: text("booking_type").notNull(),
     pax: integer("pax").notNull(),

[Survived] StringLiteral
src/drizzle/schema.ts:121:54
       .references(() => staff.id),
     bookingType: text("booking_type").notNull(),
     pax: integer("pax").notNull(),
-    baseRate: numeric("base_rate").notNull().default("0"),
+    baseRate: numeric("base_rate").notNull().default(""),
     surcharges: numeric("surcharges").notNull().default("0"),
     total: numeric("total").notNull().default("0"),

[Timeout] StringLiteral
src/drizzle/schema.ts:122:57
     bookingType: text("booking_type").notNull(),
     pax: integer("pax").notNull(),
     baseRate: numeric("base_rate").notNull().default("0"),
-    surcharges: numeric("surcharges").notNull().default("0"),
+    surcharges: numeric("surcharges").notNull().default(""),
     total: numeric("total").notNull().default("0"),
     checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),

[Survived] BooleanLiteral
src/drizzle/schema.ts:124:61
     baseRate: numeric("base_rate").notNull().default("0"),
     surcharges: numeric("surcharges").notNull().default("0"),
     total: numeric("total").notNull().default("0"),
-    checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),
+    checkedInAt: timestamp("checked_in_at", { withTimezone: false }).notNull().defaultNow(),
     bookedEndAt: timestamp("booked_end_at", { withTimezone: true }).notNull(),
     checkedOutAt: timestamp("checked_out_at", { withTimezone: true }),

[Timeout] BooleanLiteral
src/drizzle/schema.ts:125:61
     surcharges: numeric("surcharges").notNull().default("0"),
     total: numeric("total").notNull().default("0"),
     checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),
-    bookedEndAt: timestamp("booked_end_at", { withTimezone: true }).notNull(),
+    bookedEndAt: timestamp("booked_end_at", { withTimezone: false }).notNull(),
     checkedOutAt: timestamp("checked_out_at", { withTimezone: true }),
     status: text("status").notNull().default("active"),

[Timeout] StringLiteral
src/drizzle/schema.ts:125:28
     surcharges: numeric("surcharges").notNull().default("0"),
     total: numeric("total").notNull().default("0"),
     checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),
-    bookedEndAt: timestamp("booked_end_at", { withTimezone: true }).notNull(),
+    bookedEndAt: timestamp("", { withTimezone: true }).notNull(),
     checkedOutAt: timestamp("checked_out_at", { withTimezone: true }),
     status: text("status").notNull().default("active"),

[Timeout] BooleanLiteral
src/drizzle/schema.ts:126:63
     total: numeric("total").notNull().default("0"),
     checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),
     bookedEndAt: timestamp("booked_end_at", { withTimezone: true }).notNull(),
-    checkedOutAt: timestamp("checked_out_at", { withTimezone: true }),
+    checkedOutAt: timestamp("checked_out_at", { withTimezone: false }),
     status: text("status").notNull().default("active"),
     voidReason: text("void_reason"),

[Killed] StringLiteral
src/drizzle/schema.ts:126:29
     total: numeric("total").notNull().default("0"),
     checkedInAt: timestamp("checked_in_at", { withTimezone: true }).notNull().defaultNow(),
     bookedEndAt: timestamp("booked_end_at", { withTimezone: true }).notNull(),
-    checkedOutAt: timestamp("checked_out_at", { withTimezone: true }),
+    checkedOutAt: timestamp("", { withTimezone: true }),
     status: text("status").notNull().default("active"),
     voidReason: text("void_reason"),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 15ms

 ✓ test/money-reference.test.ts (9 tests) 35ms

[Timeout] ArrowFunction
src/drizzle/schema.ts:130:3
     status: text("status").notNull().default("active"),
     voidReason: text("void_reason"),
   },
-  (table) => [
-    index("sessions_org_id_idx").on(table.orgId),
-    index("sessions_branch_id_idx").on(table.branchId),
-    index("sessions_room_id_idx").on(table.roomId),
-    index("sessions_cashier_id_idx").on(table.cashierId),
-    uniqueIndex("one_active_session_per_room").on(table.roomId).where(sql`status = 'active'`),
-    check("sessions_booking_type_check", sql`booking_type in ('short_time', 'overnight')`),
-    check("sessions_pax_check", sql`pax >= 1`),
-    check("sessions_base_rate_check", sql`base_rate >= 0`),
-    check("sessions_surcharges_check", sql`surcharges >= 0`),
-    check("sessions_total_check", sql`total >= 0`),
-    check("sessions_status_check", sql`status in ('active', 'closed', 'voided')`),
-  ],
+  () => undefined,
 );
 

[Timeout] StringLiteral
src/drizzle/schema.ts:131:11
     voidReason: text("void_reason"),
   },
   (table) => [
-    index("sessions_org_id_idx").on(table.orgId),
+    index("").on(table.orgId),
     index("sessions_branch_id_idx").on(table.branchId),
     index("sessions_room_id_idx").on(table.roomId),

[Survived] StringLiteral
src/drizzle/schema.ts:138:11
     uniqueIndex("one_active_session_per_room").on(table.roomId).where(sql`status = 'active'`),
     check("sessions_booking_type_check", sql`booking_type in ('short_time', 'overnight')`),
     check("sessions_pax_check", sql`pax >= 1`),
-    check("sessions_base_rate_check", sql`base_rate >= 0`),
+    check("", sql`base_rate >= 0`),
     check("sessions_surcharges_check", sql`surcharges >= 0`),
     check("sessions_total_check", sql`total >= 0`),

[Timeout] StringLiteral
src/drizzle/schema.ts:141:11
     check("sessions_base_rate_check", sql`base_rate >= 0`),
     check("sessions_surcharges_check", sql`surcharges >= 0`),
     check("sessions_total_check", sql`total >= 0`),
-    check("sessions_status_check", sql`status in ('active', 'closed', 'voided')`),
+    check("", sql`status in ('active', 'closed', 'voided')`),
   ],
 );

[Timeout] StringLiteral
src/drizzle/schema.ts:146:3
 );
 
 export const sessionAddons = pgTable(
-  "session_addons",
+  "",
   {
     id: uuid("id").primaryKey().defaultRandom(),

[Timeout] ObjectLiteral
src/drizzle/schema.ts:147:3
 
 export const sessionAddons = pgTable(
   "session_addons",
-  {
-    id: uuid("id").primaryKey().defaultRandom(),
-    orgId: uuid("org_id")
-      .notNull()
-      .references(() => organizations.id),
-    branchId: uuid("branch_id")
-      .notNull()
-      .references(() => branches.id),
-    sessionId: uuid("session_id")
-      .notNull()
-      .references(() => sessions.id),
-    item: text("item").notNull(),
-    qty: integer("qty").notNull(),
-    unitPrice: numeric("unit_price").notNull(),
-    total: numeric("total").notNull(),
-    addedAt: timestamp("added_at", { withTimezone: true }).notNull().defaultNow(),
-    cashierId: uuid("cashier_id")
-      .notNull()
-      .references(() => staff.id),
-  },
+  {},
   (table) => [
     index("session_addons_org_id_idx").on(table.orgId),

[Killed] StringLiteral
src/drizzle/schema.ts:155:21
     branchId: uuid("branch_id")
       .notNull()
       .references(() => branches.id),
-    sessionId: uuid("session_id")
+    sessionId: uuid("")
       .notNull()
       .references(() => sessions.id),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 33ms

 ✓ test/smoke.test.ts (1 test) 13ms

[Timeout] ArrowFunction
src/drizzle/schema.ts:157:19
       .references(() => branches.id),
     sessionId: uuid("session_id")
       .notNull()
-      .references(() => sessions.id),
+      .references(() => undefined),
     item: text("item").notNull(),
     qty: integer("qty").notNull(),

[Survived] StringLiteral
src/drizzle/schema.ts:158:16
     sessionId: uuid("session_id")
       .notNull()
       .references(() => sessions.id),
-    item: text("item").notNull(),
+    item: text("").notNull(),
     qty: integer("qty").notNull(),
     unitPrice: numeric("unit_price").notNull(),

[Killed] StringLiteral
src/drizzle/schema.ts:160:24
       .references(() => sessions.id),
     item: text("item").notNull(),
     qty: integer("qty").notNull(),
-    unitPrice: numeric("unit_price").notNull(),
+    unitPrice: numeric("").notNull(),
     total: numeric("total").notNull(),
     addedAt: timestamp("added_at", { withTimezone: true }).notNull().defaultNow(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 37ms

 ✓ test/smoke.test.ts (1 test) 13ms

[Timeout] BooleanLiteral
src/drizzle/schema.ts:162:52
     qty: integer("qty").notNull(),
     unitPrice: numeric("unit_price").notNull(),
     total: numeric("total").notNull(),
-    addedAt: timestamp("added_at", { withTimezone: true }).notNull().defaultNow(),
+    addedAt: timestamp("added_at", { withTimezone: false }).notNull().defaultNow(),
     cashierId: uuid("cashier_id")
       .notNull()

[Killed] StringLiteral
src/drizzle/schema.ts:163:21
     unitPrice: numeric("unit_price").notNull(),
     total: numeric("total").notNull(),
     addedAt: timestamp("added_at", { withTimezone: true }).notNull().defaultNow(),
-    cashierId: uuid("cashier_id")
+    cashierId: uuid("")
       .notNull()
       .references(() => staff.id),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 35ms

 ✓ test/smoke.test.ts (1 test) 14ms

[Timeout] ArrowFunction
src/drizzle/schema.ts:167:3
       .notNull()
       .references(() => staff.id),
   },
-  (table) => [
-    index("session_addons_org_id_idx").on(table.orgId),
-    index("session_addons_branch_id_idx").on(table.branchId),
-    index("session_addons_session_id_idx").on(table.sessionId),
-    index("session_addons_cashier_id_idx").on(table.cashierId),
-    check("session_addons_qty_check", sql`qty >= 1`),
-    check("session_addons_unit_price_check", sql`unit_price >= 0`),
-    check("session_addons_total_check", sql`total >= 0`),
-  ],
+  () => undefined,
 );
 

[Killed] ArrayDeclaration
src/drizzle/schema.ts:167:14
       .notNull()
       .references(() => staff.id),
   },
-  (table) => [
-    index("session_addons_org_id_idx").on(table.orgId),
-    index("session_addons_branch_id_idx").on(table.branchId),
-    index("session_addons_session_id_idx").on(table.sessionId),
-    index("session_addons_cashier_id_idx").on(table.cashierId),
-    check("session_addons_qty_check", sql`qty >= 1`),
-    check("session_addons_unit_price_check", sql`unit_price >= 0`),
-    check("session_addons_total_check", sql`total >= 0`),
-  ],
+  (table) => [],
 );
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 35ms

 ✓ test/smoke.test.ts (1 test) 12ms

[Survived] StringLiteral
src/drizzle/schema.ts:170:11
   (table) => [
     index("session_addons_org_id_idx").on(table.orgId),
     index("session_addons_branch_id_idx").on(table.branchId),
-    index("session_addons_session_id_idx").on(table.sessionId),
+    index("").on(table.sessionId),
     index("session_addons_cashier_id_idx").on(table.cashierId),
     check("session_addons_qty_check", sql`qty >= 1`),

[Survived] StringLiteral
src/drizzle/schema.ts:172:42
     index("session_addons_branch_id_idx").on(table.branchId),
     index("session_addons_session_id_idx").on(table.sessionId),
     index("session_addons_cashier_id_idx").on(table.cashierId),
-    check("session_addons_qty_check", sql`qty >= 1`),
+    check("session_addons_qty_check", sql``),
     check("session_addons_unit_price_check", sql`unit_price >= 0`),
     check("session_addons_total_check", sql`total >= 0`),

[Survived] StringLiteral
src/drizzle/schema.ts:172:11
     index("session_addons_branch_id_idx").on(table.branchId),
     index("session_addons_session_id_idx").on(table.sessionId),
     index("session_addons_cashier_id_idx").on(table.cashierId),
-    check("session_addons_qty_check", sql`qty >= 1`),
+    check("", sql`qty >= 1`),
     check("session_addons_unit_price_check", sql`unit_price >= 0`),
     check("session_addons_total_check", sql`total >= 0`),

[Survived] StringLiteral
src/drizzle/schema.ts:173:49
     index("session_addons_session_id_idx").on(table.sessionId),
     index("session_addons_cashier_id_idx").on(table.cashierId),
     check("session_addons_qty_check", sql`qty >= 1`),
-    check("session_addons_unit_price_check", sql`unit_price >= 0`),
+    check("session_addons_unit_price_check", sql``),
     check("session_addons_total_check", sql`total >= 0`),
   ],

[Survived] ArrowFunction
src/drizzle/schema.ts:188:46
     branchId: uuid("branch_id")
       .notNull()
       .references(() => branches.id),
-    sessionId: uuid("session_id").references(() => sessions.id),
+    sessionId: uuid("session_id").references(() => undefined),
     item: text("item").notNull(),
     qty: integer("qty").notNull(),

[Timeout] StringLiteral
src/drizzle/schema.ts:190:18
       .references(() => branches.id),
     sessionId: uuid("session_id").references(() => sessions.id),
     item: text("item").notNull(),
-    qty: integer("qty").notNull(),
+    qty: integer("").notNull(),
     unitPrice: numeric("unit_price").notNull(),
     total: numeric("total").notNull(),

[Survived] StringLiteral
src/drizzle/schema.ts:192:20
     item: text("item").notNull(),
     qty: integer("qty").notNull(),
     unitPrice: numeric("unit_price").notNull(),
-    total: numeric("total").notNull(),
+    total: numeric("").notNull(),
     soldAt: timestamp("sold_at", { withTimezone: true }).notNull().defaultNow(),
     cashierId: uuid("cashier_id")

[Survived] BooleanLiteral
src/drizzle/schema.ts:193:50
     qty: integer("qty").notNull(),
     unitPrice: numeric("unit_price").notNull(),
     total: numeric("total").notNull(),
-    soldAt: timestamp("sold_at", { withTimezone: true }).notNull().defaultNow(),
+    soldAt: timestamp("sold_at", { withTimezone: false }).notNull().defaultNow(),
     cashierId: uuid("cashier_id")
       .notNull()

[Timeout] StringLiteral
src/drizzle/schema.ts:194:21
     unitPrice: numeric("unit_price").notNull(),
     total: numeric("total").notNull(),
     soldAt: timestamp("sold_at", { withTimezone: true }).notNull().defaultNow(),
-    cashierId: uuid("cashier_id")
+    cashierId: uuid("")
       .notNull()
       .references(() => staff.id),

[Timeout] ArrowFunction
src/drizzle/schema.ts:198:3
       .notNull()
       .references(() => staff.id),
   },
-  (table) => [
-    index("canteen_sales_org_id_idx").on(table.orgId),
-    index("canteen_sales_branch_id_idx").on(table.branchId),
-    index("canteen_sales_session_id_idx").on(table.sessionId),
-    index("canteen_sales_cashier_id_idx").on(table.cashierId),
-    check("canteen_sales_qty_check", sql`qty >= 1`),
-    check("canteen_sales_unit_price_check", sql`unit_price >= 0`),
-    check("canteen_sales_total_check", sql`total >= 0`),
-  ],
+  () => undefined,
 );
 

[Timeout] ArrayDeclaration
src/drizzle/schema.ts:198:14
       .notNull()
       .references(() => staff.id),
   },
-  (table) => [
-    index("canteen_sales_org_id_idx").on(table.orgId),
-    index("canteen_sales_branch_id_idx").on(table.branchId),
-    index("canteen_sales_session_id_idx").on(table.sessionId),
-    index("canteen_sales_cashier_id_idx").on(table.cashierId),
-    check("canteen_sales_qty_check", sql`qty >= 1`),
-    check("canteen_sales_unit_price_check", sql`unit_price >= 0`),
-    check("canteen_sales_total_check", sql`total >= 0`),
-  ],
+  (table) => [],
 );
 
