[Killed] StringLiteral
src/drizzle/schema.ts:200:11
   },
   (table) => [
     index("canteen_sales_org_id_idx").on(table.orgId),
-    index("canteen_sales_branch_id_idx").on(table.branchId),
+    index("").on(table.branchId),
     index("canteen_sales_session_id_idx").on(table.sessionId),
     index("canteen_sales_cashier_id_idx").on(table.cashierId),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 13ms

 ✓ test/money-reference.test.ts (9 tests) 37ms

[Survived] StringLiteral
src/drizzle/schema.ts:203:41
     index("canteen_sales_branch_id_idx").on(table.branchId),
     index("canteen_sales_session_id_idx").on(table.sessionId),
     index("canteen_sales_cashier_id_idx").on(table.cashierId),
-    check("canteen_sales_qty_check", sql`qty >= 1`),
+    check("canteen_sales_qty_check", sql``),
     check("canteen_sales_unit_price_check", sql`unit_price >= 0`),
     check("canteen_sales_total_check", sql`total >= 0`),

[Survived] StringLiteral
src/drizzle/schema.ts:205:11
     index("canteen_sales_cashier_id_idx").on(table.cashierId),
     check("canteen_sales_qty_check", sql`qty >= 1`),
     check("canteen_sales_unit_price_check", sql`unit_price >= 0`),
-    check("canteen_sales_total_check", sql`total >= 0`),
+    check("", sql`total >= 0`),
   ],
 );

[Timeout] BooleanLiteral
src/drizzle/schema.ts:222:54
     openedBy: uuid("opened_by")
       .notNull()
       .references(() => staff.id),
-    openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
+    openedAt: timestamp("opened_at", { withTimezone: false }).notNull().defaultNow(),
     closedBy: uuid("closed_by").references(() => staff.id),
     closedAt: timestamp("closed_at", { withTimezone: true }),

[Timeout] StringLiteral
src/drizzle/schema.ts:222:25
     openedBy: uuid("opened_by")
       .notNull()
       .references(() => staff.id),
-    openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
+    openedAt: timestamp("", { withTimezone: true }).notNull().defaultNow(),
     closedBy: uuid("closed_by").references(() => staff.id),
     closedAt: timestamp("closed_at", { withTimezone: true }),

[Timeout] ArrowFunction
src/drizzle/schema.ts:223:44
       .notNull()
       .references(() => staff.id),
     openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
-    closedBy: uuid("closed_by").references(() => staff.id),
+    closedBy: uuid("closed_by").references(() => undefined),
     closedAt: timestamp("closed_at", { withTimezone: true }),
     expectedRoom: numeric("expected_room").notNull().default("0"),

[Timeout] StringLiteral
src/drizzle/schema.ts:223:20
       .notNull()
       .references(() => staff.id),
     openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
-    closedBy: uuid("closed_by").references(() => staff.id),
+    closedBy: uuid("").references(() => staff.id),
     closedAt: timestamp("closed_at", { withTimezone: true }),
     expectedRoom: numeric("expected_room").notNull().default("0"),

[Timeout] BooleanLiteral
src/drizzle/schema.ts:224:54
       .references(() => staff.id),
     openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
     closedBy: uuid("closed_by").references(() => staff.id),
-    closedAt: timestamp("closed_at", { withTimezone: true }),
+    closedAt: timestamp("closed_at", { withTimezone: false }),
     expectedRoom: numeric("expected_room").notNull().default("0"),
     expectedAddons: numeric("expected_addons").notNull().default("0"),

[Timeout] ObjectLiteral
src/drizzle/schema.ts:224:38
       .references(() => staff.id),
     openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
     closedBy: uuid("closed_by").references(() => staff.id),
-    closedAt: timestamp("closed_at", { withTimezone: true }),
+    closedAt: timestamp("closed_at", {}),
     expectedRoom: numeric("expected_room").notNull().default("0"),
     expectedAddons: numeric("expected_addons").notNull().default("0"),

[Timeout] StringLiteral
src/drizzle/schema.ts:225:27
     openedAt: timestamp("opened_at", { withTimezone: true }).notNull().defaultNow(),
     closedBy: uuid("closed_by").references(() => staff.id),
     closedAt: timestamp("closed_at", { withTimezone: true }),
-    expectedRoom: numeric("expected_room").notNull().default("0"),
+    expectedRoom: numeric("").notNull().default("0"),
     expectedAddons: numeric("expected_addons").notNull().default("0"),
     expectedCanteen: numeric("expected_canteen").notNull().default("0"),

[Survived] StringLiteral
src/drizzle/schema.ts:226:66
     closedBy: uuid("closed_by").references(() => staff.id),
     closedAt: timestamp("closed_at", { withTimezone: true }),
     expectedRoom: numeric("expected_room").notNull().default("0"),
-    expectedAddons: numeric("expected_addons").notNull().default("0"),
+    expectedAddons: numeric("expected_addons").notNull().default(""),
     expectedCanteen: numeric("expected_canteen").notNull().default("0"),
     expectedTotal: numeric("expected_total").notNull().default("0"),

[Survived] StringLiteral
src/drizzle/schema.ts:227:68
     closedAt: timestamp("closed_at", { withTimezone: true }),
     expectedRoom: numeric("expected_room").notNull().default("0"),
     expectedAddons: numeric("expected_addons").notNull().default("0"),
-    expectedCanteen: numeric("expected_canteen").notNull().default("0"),
+    expectedCanteen: numeric("expected_canteen").notNull().default(""),
     expectedTotal: numeric("expected_total").notNull().default("0"),
     countedTotal: numeric("counted_total"),

[Timeout] StringLiteral
src/drizzle/schema.ts:227:30
     closedAt: timestamp("closed_at", { withTimezone: true }),
     expectedRoom: numeric("expected_room").notNull().default("0"),
     expectedAddons: numeric("expected_addons").notNull().default("0"),
-    expectedCanteen: numeric("expected_canteen").notNull().default("0"),
+    expectedCanteen: numeric("").notNull().default("0"),
     expectedTotal: numeric("expected_total").notNull().default("0"),
     countedTotal: numeric("counted_total"),

[Survived] StringLiteral
src/drizzle/schema.ts:231:18
     expectedTotal: numeric("expected_total").notNull().default("0"),
     countedTotal: numeric("counted_total"),
     variance: numeric("variance"),
-    status: text("status").notNull().default("open"),
+    status: text("").notNull().default("open"),
   },
   (table) => [

[Killed] ArrowFunction
src/drizzle/schema.ts:233:3
     variance: numeric("variance"),
     status: text("status").notNull().default("open"),
   },
-  (table) => [
-    index("shifts_org_id_idx").on(table.orgId),
-    index("shifts_branch_id_idx").on(table.branchId),
-    index("shifts_opened_by_idx").on(table.openedBy),
-    index("shifts_closed_by_idx").on(table.closedBy),
-    uniqueIndex("one_open_shift_per_branch").on(table.branchId).where(sql`status = 'open'`),
-    check("shifts_status_check", sql`status in ('open', 'closed')`),
-  ],
+  () => undefined,
 );
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 14ms

 ✓ test/money-reference.test.ts (9 tests) 35ms

[Timeout] StringLiteral
src/drizzle/schema.ts:234:11
     status: text("status").notNull().default("open"),
   },
   (table) => [
-    index("shifts_org_id_idx").on(table.orgId),
+    index("").on(table.orgId),
     index("shifts_branch_id_idx").on(table.branchId),
     index("shifts_opened_by_idx").on(table.openedBy),

[Killed] StringLiteral
src/drizzle/schema.ts:235:11
   },
   (table) => [
     index("shifts_org_id_idx").on(table.orgId),
-    index("shifts_branch_id_idx").on(table.branchId),
+    index("").on(table.branchId),
     index("shifts_opened_by_idx").on(table.openedBy),
     index("shifts_closed_by_idx").on(table.closedBy),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 38ms

 ✓ test/smoke.test.ts (1 test) 14ms

[Survived] StringLiteral
src/drizzle/schema.ts:236:11
   (table) => [
     index("shifts_org_id_idx").on(table.orgId),
     index("shifts_branch_id_idx").on(table.branchId),
-    index("shifts_opened_by_idx").on(table.openedBy),
+    index("").on(table.openedBy),
     index("shifts_closed_by_idx").on(table.closedBy),
     uniqueIndex("one_open_shift_per_branch").on(table.branchId).where(sql`status = 'open'`),

[Killed] StringLiteral
src/drizzle/schema.ts:244:3
 );
 
 export const auditLog = pgTable(
-  "audit_log",
+  "",
   {
     id: uuid("id").primaryKey().defaultRandom(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 13ms

 ✓ test/money-reference.test.ts (9 tests) 35ms

[Timeout] ObjectLiteral
src/drizzle/schema.ts:245:3
 
 export const auditLog = pgTable(
   "audit_log",
-  {
-    id: uuid("id").primaryKey().defaultRandom(),
-    orgId: uuid("org_id").references(() => organizations.id),
-    branchId: uuid("branch_id").references(() => branches.id),
-    actorId: uuid("actor_id").notNull(),
-    action: text("action").notNull(),
-    targetTable: text("target_table").notNull(),
-    targetId: uuid("target_id").notNull(),
-    oldData: jsonb("old_data"),
-    newData: jsonb("new_data"),
-    ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
-  },
+  {},
   (table) => [
     index("audit_log_org_id_idx").on(table.orgId),

[Timeout] ArrowFunction
src/drizzle/schema.ts:247:38
   "audit_log",
   {
     id: uuid("id").primaryKey().defaultRandom(),
-    orgId: uuid("org_id").references(() => organizations.id),
+    orgId: uuid("org_id").references(() => undefined),
     branchId: uuid("branch_id").references(() => branches.id),
     actorId: uuid("actor_id").notNull(),

[Survived] ArrowFunction
src/drizzle/schema.ts:248:44
   {
     id: uuid("id").primaryKey().defaultRandom(),
     orgId: uuid("org_id").references(() => organizations.id),
-    branchId: uuid("branch_id").references(() => branches.id),
+    branchId: uuid("branch_id").references(() => undefined),
     actorId: uuid("actor_id").notNull(),
     action: text("action").notNull(),

[Timeout] StringLiteral
src/drizzle/schema.ts:248:20
   {
     id: uuid("id").primaryKey().defaultRandom(),
     orgId: uuid("org_id").references(() => organizations.id),
-    branchId: uuid("branch_id").references(() => branches.id),
+    branchId: uuid("").references(() => branches.id),
     actorId: uuid("actor_id").notNull(),
     action: text("action").notNull(),

[Killed] StringLiteral
src/drizzle/schema.ts:253:20
     action: text("action").notNull(),
     targetTable: text("target_table").notNull(),
     targetId: uuid("target_id").notNull(),
-    oldData: jsonb("old_data"),
+    oldData: jsonb(""),
     newData: jsonb("new_data"),
     ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/money-reference.test.ts (9 tests) 36ms

 ✓ test/smoke.test.ts (1 test) 18ms

[Timeout] BooleanLiteral
src/drizzle/schema.ts:255:41
     targetId: uuid("target_id").notNull(),
     oldData: jsonb("old_data"),
     newData: jsonb("new_data"),
-    ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
+    ts: timestamp("ts", { withTimezone: false }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] StringLiteral
src/drizzle/schema.ts:255:19
     targetId: uuid("target_id").notNull(),
     oldData: jsonb("old_data"),
     newData: jsonb("new_data"),
-    ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
+    ts: timestamp("", { withTimezone: true }).notNull().defaultNow(),
   },
   (table) => [

[Timeout] ArrowFunction
src/drizzle/schema.ts:257:3
     newData: jsonb("new_data"),
     ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    index("audit_log_org_id_idx").on(table.orgId),
-    index("audit_log_branch_id_idx").on(table.branchId),
-    index("audit_log_target_idx").on(table.targetTable, table.targetId),
-  ],
+  () => undefined,
 );
 

[Killed] ArrayDeclaration
src/drizzle/schema.ts:257:14
     newData: jsonb("new_data"),
     ts: timestamp("ts", { withTimezone: true }).notNull().defaultNow(),
   },
-  (table) => [
-    index("audit_log_org_id_idx").on(table.orgId),
-    index("audit_log_branch_id_idx").on(table.branchId),
-    index("audit_log_target_idx").on(table.targetTable, table.targetId),
-  ],
+  (table) => [],
 );
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 14ms

 ✓ test/money-reference.test.ts (9 tests) 36ms

[Timeout] StringLiteral
src/drizzle/schema.ts:260:11
   (table) => [
     index("audit_log_org_id_idx").on(table.orgId),
     index("audit_log_branch_id_idx").on(table.branchId),
-    index("audit_log_target_idx").on(table.targetTable, table.targetId),
+    index("").on(table.targetTable, table.targetId),
   ],
 );
