[Timeout] EqualityOperator
src/money-reference.ts:114:58
 ): { base: number; surcharge: number; total: number } {
   if (bookingType === "short_time") {
     let surcharge = 0;
-    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
+    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest > pax; guest += 1) {
       surcharge += STAY_TYPES.short_time.extra_pax_charge;
     }

[Killed] ConditionalExpression
src/money-reference.ts:126:20
     .filter((key) => key <= pax);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
-  const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
+  const selected = true ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
   const base = tiers[selected];
   if (base === undefined) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-whJwIT



 ✓ test/smoke.test.ts (1 test) 13ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 117ms

[Timeout] EqualityOperator
src/money-reference.ts:132:65
     throw new Error("the overnight tier list is empty");
   }
   let surcharge = 0;
-  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
+  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest > pax; guest += 1) {
     surcharge += STAY_TYPES.overnight.extra_pax_charge;
   }
