[Killed] ConditionalExpression
src/money-reference.ts:112:7
   bookingType: BookingType,
   pax: number,
 ): { base: number; surcharge: number; total: number } {
-  if (bookingType === "short_time") {
+  if (false) {
     let surcharge = 0;
     for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 9ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 48ms

[Killed] BlockStatement
src/money-reference.ts:112:37
   bookingType: BookingType,
   pax: number,
 ): { base: number; surcharge: number; total: number } {
-  if (bookingType === "short_time") {
-    let surcharge = 0;
-    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
-      surcharge += STAY_TYPES.short_time.extra_pax_charge;
-    }
-    return { base: STAY_TYPES.short_time.flat_base, surcharge, total: STAY_TYPES.short_time.flat_base + surcharge };
-  }
+  if (bookingType === "short_time") {}
 
   const tiers: Readonly<Record<number, number>> = STAY_TYPES.overnight.tiers;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 44ms

[Killed] EqualityOperator
src/money-reference.ts:114:58
 ): { base: number; surcharge: number; total: number } {
   if (bookingType === "short_time") {
     let surcharge = 0;
-    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
+    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest < pax; guest += 1) {
       surcharge += STAY_TYPES.short_time.extra_pax_charge;
     }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 11ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 49ms

[Killed] ArithmeticOperator
src/money-reference.ts:114:22
 ): { base: number; surcharge: number; total: number } {
   if (bookingType === "short_time") {
     let surcharge = 0;
-    for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
+    for (let guest = STAY_TYPES.short_time.base_pax - 1; guest <= pax; guest += 1) {
       surcharge += STAY_TYPES.short_time.extra_pax_charge;
     }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 44ms

[Killed] AssignmentOperator
src/money-reference.ts:115:7
   if (bookingType === "short_time") {
     let surcharge = 0;
     for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
-      surcharge += STAY_TYPES.short_time.extra_pax_charge;
+      surcharge -= STAY_TYPES.short_time.extra_pax_charge;
     }
     return { base: STAY_TYPES.short_time.flat_base, surcharge, total: STAY_TYPES.short_time.flat_base + surcharge };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 9ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 56ms

[Killed] ArithmeticOperator
src/money-reference.ts:117:71
     for (let guest = STAY_TYPES.short_time.base_pax + 1; guest <= pax; guest += 1) {
       surcharge += STAY_TYPES.short_time.extra_pax_charge;
     }
-    return { base: STAY_TYPES.short_time.flat_base, surcharge, total: STAY_TYPES.short_time.flat_base + surcharge };
+    return { base: STAY_TYPES.short_time.flat_base, surcharge, total: STAY_TYPES.short_time.flat_base - surcharge };
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 9ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 52ms

[Killed] MethodExpression
src/money-reference.ts:121:20
   }
 
   const tiers: Readonly<Record<number, number>> = STAY_TYPES.overnight.tiers;
-  const tierKeys = Object.keys(tiers)
-    .map(Number)
-    .filter((key) => key <= pax);
+  const tierKeys = Object.keys(tiers).map(Number);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 10ms

 ❯ test/money-reference.test.ts (9 tests | 2 failed) 54ms

[Killed] EqualityOperator
src/money-reference.ts:123:22
   const tiers: Readonly<Record<number, number>> = STAY_TYPES.overnight.tiers;
   const tierKeys = Object.keys(tiers)
     .map(Number)
-    .filter((key) => key <= pax);
+    .filter((key) => key > pax);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 2 failed) 57ms

[Killed] ArrowFunction
src/money-reference.ts:123:13
   const tiers: Readonly<Record<number, number>> = STAY_TYPES.overnight.tiers;
   const tierKeys = Object.keys(tiers)
     .map(Number)
-    .filter((key) => key <= pax);
+    .filter(() => undefined);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 12ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 52ms

[Killed] EqualityOperator
src/money-reference.ts:126:20
     .filter((key) => key <= pax);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
-  const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
+  const selected = tierKeys.length <= 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
   const base = tiers[selected];
   if (base === undefined) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 2 failed) 53ms

[Killed] MethodExpression
src/money-reference.ts:126:66
     .filter((key) => key <= pax);
   // Tier selection is order-independent: the highest tier not exceeding the
   // guest count; a booking below every tier resolves to the lowest (vault-03).
-  const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
+  const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.max(...Object.keys(tiers).map(Number));
   const base = tiers[selected];
   if (base === undefined) {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 10ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 55ms

[Killed] ConditionalExpression
src/money-reference.ts:128:7
   // guest count; a booking below every tier resolves to the lowest (vault-03).
   const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
   const base = tiers[selected];
-  if (base === undefined) {
+  if (true) {
     throw new Error("the overnight tier list is empty");
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ❯ test/money-reference.test.ts (9 tests | 2 failed) 39ms

   ❯ money reference fixture (spec/domain-rules.md §1) (9)

[Killed] EqualityOperator
src/money-reference.ts:128:7
   // guest count; a booking below every tier resolves to the lowest (vault-03).
   const selected = tierKeys.length > 0 ? Math.max(...tierKeys) : Math.min(...Object.keys(tiers).map(Number));
   const base = tiers[selected];
-  if (base === undefined) {
+  if (base !== undefined) {
     throw new Error("the overnight tier list is empty");
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 10ms

 ❯ test/money-reference.test.ts (9 tests | 2 failed) 43ms

[Killed] ConditionalExpression
src/money-reference.ts:132:65
     throw new Error("the overnight tier list is empty");
   }
   let surcharge = 0;
-  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
+  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; false; guest += 1) {
     surcharge += STAY_TYPES.overnight.extra_pax_charge;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 12ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 56ms

[Killed] BlockStatement
src/money-reference.ts:132:91
     throw new Error("the overnight tier list is empty");
   }
   let surcharge = 0;
-  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
-    surcharge += STAY_TYPES.overnight.extra_pax_charge;
-  }
+  for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {}
   return { base, surcharge, total: base + surcharge };
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 45ms

[Killed] AssignmentOperator
src/money-reference.ts:133:5
   }
   let surcharge = 0;
   for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
-    surcharge += STAY_TYPES.overnight.extra_pax_charge;
+    surcharge -= STAY_TYPES.overnight.extra_pax_charge;
   }
   return { base, surcharge, total: base + surcharge };
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 43ms

[Killed] ArithmeticOperator
src/money-reference.ts:135:36
   for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
     surcharge += STAY_TYPES.overnight.extra_pax_charge;
   }
-  return { base, surcharge, total: base + surcharge };
+  return { base, surcharge, total: base - surcharge };
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/money-reference.test.ts (9 tests | 1 failed) 46ms

[Killed] ObjectLiteral
src/money-reference.ts:135:10
   for (let guest = STAY_TYPES.overnight.surcharge_base_pax + 1; guest <= pax; guest += 1) {
     surcharge += STAY_TYPES.overnight.extra_pax_charge;
   }
-  return { base, surcharge, total: base + surcharge };
+  return {};
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/db/.stryker-tmp/sandbox-0jXpsE



 ✓ test/smoke.test.ts (1 test) 10ms

 ❯ test/money-reference.test.ts (9 tests | 2 failed) 46ms
