[Killed] LogicalOperator
src/branch.schema.ts:18:63
 
 /** The branch view the rate-configuration surfaces read: identity + card. */
 export const branchWithRateConfigSchema = branchViewSchema.extend({
-  rateConfig: rateConfigSchema.nullish().transform((value) => value ?? undefined),
+  rateConfig: rateConfigSchema.nullish().transform((value) => value && undefined),
 });
 export type BranchWithRateConfig = z.output<typeof branchWithRateConfigSchema>;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/views.test.ts (5 tests | 1 failed) 47ms

[Killed] ArrowFunction
src/branch.schema.ts:18:52
 
 /** The branch view the rate-configuration surfaces read: identity + card. */
 export const branchWithRateConfigSchema = branchViewSchema.extend({
-  rateConfig: rateConfigSchema.nullish().transform((value) => value ?? undefined),
+  rateConfig: rateConfigSchema.nullish().transform(() => undefined),
 });
 export type BranchWithRateConfig = z.output<typeof branchWithRateConfigSchema>;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ❯ test/views.test.ts (5 tests | 1 failed) 44ms
