[Killed] Regex
src/rate-config.schema.ts:27:30
  * are the database's own acceptance regexes (migrations 20260924163000 and
  * 20260924160000), mirrored character for character.
  */
-const MINUTES_TEXT_PATTERN = /^[0-9]{1,9}$/;
+const MINUTES_TEXT_PATTERN = /^[^0-9]{1,9}$/;
 const MONEY_TEXT_PATTERN = /^[0-9]{1,12}(\.[0-9]+)?$/;
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 32ms

[Killed] Regex
src/rate-config.schema.ts:28:28
  * 20260924160000), mirrored character for character.
  */
 const MINUTES_TEXT_PATTERN = /^[0-9]{1,9}$/;
-const MONEY_TEXT_PATTERN = /^[0-9]{1,12}(\.[0-9]+)?$/;
+const MONEY_TEXT_PATTERN = /^[0-9](\.[0-9]+)?$/;
 
 /** spec/domain-rules.md §3.3: money text is "up to 12 characters". */
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 28ms

[Killed] Regex
src/rate-config.schema.ts:28:28
  * 20260924160000), mirrored character for character.
  */
 const MINUTES_TEXT_PATTERN = /^[0-9]{1,9}$/;
-const MONEY_TEXT_PATTERN = /^[0-9]{1,12}(\.[0-9]+)?$/;
+const MONEY_TEXT_PATTERN = /^[0-9]{1,12}(\.[0-9])?$/;
 
 /** spec/domain-rules.md §3.3: money text is "up to 12 characters". */
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 29ms

[Killed] BlockStatement
src/rate-config.schema.ts:36:54
 export type OverrideText = string | number;
 
 /** The jsonb text form the database function extracts from the merge payload. */
-function overrideToText(value: OverrideText): string {
-  return String(value);
-}
+function overrideToText(value: OverrideText): string {}
 
 /** vault-07: "150.50 is accepted as 150.5" — trailing decimal zeros drop. */
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 31ms

[Killed] BlockStatement
src/rate-config.schema.ts:41:58
 }
 
 /** vault-07: "150.50 is accepted as 150.5" — trailing decimal zeros drop. */
-export function normalizeMoneyText(text: string): string {
-  if (!text.includes(".")) {
-    return text;
-  }
-  const trimmed = text.replace(/0+$/, "").replace(/\.$/, "");
-  return trimmed === "" ? "0" : trimmed;
-}
+export function normalizeMoneyText(text: string): string {}
 
 function parseStoredInteger(text: string): number {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 27ms

[Killed] BooleanLiteral
src/rate-config.schema.ts:42:7
 
 /** vault-07: "150.50 is accepted as 150.5" — trailing decimal zeros drop. */
 export function normalizeMoneyText(text: string): string {
-  if (!text.includes(".")) {
+  if (text.includes(".")) {
     return text;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:42:7
 
 /** vault-07: "150.50 is accepted as 150.5" — trailing decimal zeros drop. */
 export function normalizeMoneyText(text: string): string {
-  if (!text.includes(".")) {
+  if (false) {
     return text;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 10ms

 ✓ test/views.test.ts (5 tests) 27ms

[Killed] Regex
src/rate-config.schema.ts:45:51
   if (!text.includes(".")) {
     return text;
   }
-  const trimmed = text.replace(/0+$/, "").replace(/\.$/, "");
+  const trimmed = text.replace(/0+$/, "").replace(/\./, "");
   return trimmed === "" ? "0" : trimmed;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 10ms

 ✓ test/views.test.ts (5 tests) 29ms

[Killed] Regex
src/rate-config.schema.ts:45:32
   if (!text.includes(".")) {
     return text;
   }
-  const trimmed = text.replace(/0+$/, "").replace(/\.$/, "");
+  const trimmed = text.replace(/0$/, "").replace(/\.$/, "");
   return trimmed === "" ? "0" : trimmed;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:46:10
     return text;
   }
   const trimmed = text.replace(/0+$/, "").replace(/\.$/, "");
-  return trimmed === "" ? "0" : trimmed;
+  return true ? "0" : trimmed;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:46:10
     return text;
   }
   const trimmed = text.replace(/0+$/, "").replace(/\.$/, "");
-  return trimmed === "" ? "0" : trimmed;
+  return false ? "0" : trimmed;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 31ms

[Killed] BlockStatement
src/rate-config.schema.ts:49:51
   return trimmed === "" ? "0" : trimmed;
 }
 
-function parseStoredInteger(text: string): number {
-  return Number.parseInt(text, 10);
-}
+function parseStoredInteger(text: string): number {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 34ms

[Killed] BlockStatement
src/rate-config.schema.ts:58:57
  * integer cast cannot overflow). `allowZero` distinguishes grace (zero is
  * legal) from block length (zero would charge per-minute and is refused).
  */
-function minutesSchema(options: { allowZero: boolean }) {
-  const base = z
-    .union([z.string(), z.number()])
-    .transform(overrideToText)
-    .pipe(z.string().regex(MINUTES_TEXT_PATTERN, "must be digit-only text of at most 9 digits"));
-  if (options.allowZero) {
-    return base;
-  }
-  return base.refine((text) => parseStoredInteger(text) > 0, {
-    message: "must be greater than zero (a zero-length block is never saved)",
-  });
-}
+function minutesSchema(options: { allowZero: boolean }) {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ❯ test/smoke.test.ts (0 test)

 ❯ test/rate-config.schema.test.ts (0 test)

[Killed] ConditionalExpression
src/rate-config.schema.ts:63:7
     .union([z.string(), z.number()])
     .transform(overrideToText)
     .pipe(z.string().regex(MINUTES_TEXT_PATTERN, "must be digit-only text of at most 9 digits"));
-  if (options.allowZero) {
+  if (false) {
     return base;
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 33ms

[Killed] BlockStatement
src/rate-config.schema.ts:63:26
     .union([z.string(), z.number()])
     .transform(overrideToText)
     .pipe(z.string().regex(MINUTES_TEXT_PATTERN, "must be digit-only text of at most 9 digits"));
-  if (options.allowZero) {
-    return base;
-  }
+  if (options.allowZero) {}
   return base.refine((text) => parseStoredInteger(text) > 0, {
     message: "must be greater than zero (a zero-length block is never saved)",
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 28ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:66:32
   if (options.allowZero) {
     return base;
   }
-  return base.refine((text) => parseStoredInteger(text) > 0, {
+  return base.refine((text) => false, {
     message: "must be greater than zero (a zero-length block is never saved)",
   });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 11ms

 ✓ test/views.test.ts (5 tests) 42ms

[Killed] EqualityOperator
src/rate-config.schema.ts:66:32
   if (options.allowZero) {
     return base;
   }
-  return base.refine((text) => parseStoredInteger(text) > 0, {
+  return base.refine((text) => parseStoredInteger(text) <= 0, {
     message: "must be greater than zero (a zero-length block is never saved)",
   });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 14ms

 ✓ test/views.test.ts (5 tests) 45ms

[Killed] StringLiteral
src/rate-config.schema.ts:67:14
     return base;
   }
   return base.refine((text) => parseStoredInteger(text) > 0, {
-    message: "must be greater than zero (a zero-length block is never saved)",
+    message: "",
   });
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 12ms

 ✓ test/views.test.ts (5 tests) 89ms

[Killed] BlockStatement
src/rate-config.schema.ts:79:57
  * positive for block_charge, zero legal for canteen prices (vault-08).
  * Accepted text is normalized (trailing decimal zeros dropped).
  */
-function moneySchema(range: "positive" | "nonnegative") {
-  const base = z
-    .union([z.string(), z.number()])
-    .transform(overrideToText)
-    .pipe(
-      z
-        .string()
-        .regex(MONEY_TEXT_PATTERN, "must be digits with optional decimals")
-        .refine((text) => text.length <= MAX_MONEY_TEXT_LENGTH, {
-          message: "must be at most 12 characters",
-        }),
-    )
-    .transform(normalizeMoneyText);
-  if (range === "positive") {
-    return base.refine((text) => Number.parseFloat(text) > 0, {
-      message: "must be strictly positive",
-    });
-  }
-  return base;
-}
+function moneySchema(range: "positive" | "nonnegative") {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ❯ test/smoke.test.ts (0 test)

 ❯ test/views.test.ts (0 test)

[Killed] ArrowFunction
src/rate-config.schema.ts:87:17
       z
         .string()
         .regex(MONEY_TEXT_PATTERN, "must be digits with optional decimals")
-        .refine((text) => text.length <= MAX_MONEY_TEXT_LENGTH, {
+        .refine(() => undefined, {
           message: "must be at most 12 characters",
         }),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 7ms

 ✓ test/views.test.ts (5 tests) 28ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:87:27
       z
         .string()
         .regex(MONEY_TEXT_PATTERN, "must be digits with optional decimals")
-        .refine((text) => text.length <= MAX_MONEY_TEXT_LENGTH, {
+        .refine((text) => true, {
           message: "must be at most 12 characters",
         }),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 33ms

[Killed] StringLiteral
src/rate-config.schema.ts:88:20
         .string()
         .regex(MONEY_TEXT_PATTERN, "must be digits with optional decimals")
         .refine((text) => text.length <= MAX_MONEY_TEXT_LENGTH, {
-          message: "must be at most 12 characters",
+          message: "",
         }),
     )
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 40ms

[Killed] BlockStatement
src/rate-config.schema.ts:92:29
         }),
     )
     .transform(normalizeMoneyText);
-  if (range === "positive") {
-    return base.refine((text) => Number.parseFloat(text) > 0, {
-      message: "must be strictly positive",
-    });
-  }
+  if (range === "positive") {}
   return base;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 12ms

 ✓ test/views.test.ts (5 tests) 46ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:92:7
         }),
     )
     .transform(normalizeMoneyText);
-  if (range === "positive") {
+  if (false) {
     return base.refine((text) => Number.parseFloat(text) > 0, {
       message: "must be strictly positive",
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 32ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:93:34
     )
     .transform(normalizeMoneyText);
   if (range === "positive") {
-    return base.refine((text) => Number.parseFloat(text) > 0, {
+    return base.refine((text) => true, {
       message: "must be strictly positive",
     });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 15ms

 ✓ test/views.test.ts (5 tests) 37ms

[Killed] EqualityOperator
src/rate-config.schema.ts:93:34
     )
     .transform(normalizeMoneyText);
   if (range === "positive") {
-    return base.refine((text) => Number.parseFloat(text) > 0, {
+    return base.refine((text) => Number.parseFloat(text) >= 0, {
       message: "must be strictly positive",
     });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 27ms

[Killed] BooleanLiteral
src/rate-config.schema.ts:106:45
  * refused (strictObject) just as the database refuses them.
  */
 export const extensionOverridesSchema = z.strictObject({
-  grace_minutes: minutesSchema({ allowZero: true }).optional(),
+  grace_minutes: minutesSchema({ allowZero: false }).optional(),
   block_minutes: minutesSchema({ allowZero: false }).optional(),
   block_charge: moneySchema("positive").optional(),
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 31ms

[Killed] BooleanLiteral
src/rate-config.schema.ts:107:45
  */
 export const extensionOverridesSchema = z.strictObject({
   grace_minutes: minutesSchema({ allowZero: true }).optional(),
-  block_minutes: minutesSchema({ allowZero: false }).optional(),
+  block_minutes: minutesSchema({ allowZero: true }).optional(),
   block_charge: moneySchema("positive").optional(),
 });
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 30ms

[Survived] ObjectLiteral
src/rate-config.schema.ts:107:32
  */
 export const extensionOverridesSchema = z.strictObject({
   grace_minutes: minutesSchema({ allowZero: true }).optional(),
-  block_minutes: minutesSchema({ allowZero: false }).optional(),
+  block_minutes: minutesSchema({}).optional(),
   block_charge: moneySchema("positive").optional(),
 });

[Survived] ObjectLiteral
src/rate-config.schema.ts:158:47
  * text). A corrupted card still parses — §3.4: the display degrades, it
  * never lies, and the server seals the real money from the ledger.
  */
-export const rateConfigSchema = z.looseObject({
-  stay_types: z.looseObject({}).optional(),
-  extension: z
-    .looseObject({
-      grace_minutes: storedScalarSchema,
-      block_minutes: storedScalarSchema,
-      block_charge: storedScalarSchema,
-    })
-    .optional(),
-  addons: z.record(z.string(), storedScalarSchema).optional(),
-  canteen: z
-    .looseObject({
-      catalogue: z
-        .record(z.string(), z.looseObject({ label: z.string().optional(), price: storedScalarSchema, category: z.string().optional() }))
-        .optional(),
-      overrides: z.record(z.string(), storedScalarSchema).optional(),
-    })
-    .optional(),
-});
+export const rateConfigSchema = z.looseObject({});
 export type RateConfig = z.output<typeof rateConfigSchema>;
 

[Killed] BlockStatement
src/rate-config.schema.ts:183:84
 export type OverstayTriple = { graceMinutes: number; blockMinutes: number; blockCharge: number };
 
 /** The stored scalar's text form (the database reads jsonb values as text). */
-function storedText(value: string | number | undefined | null): string | undefined {
-  return value === undefined || value === null ? undefined : String(value);
-}
+function storedText(value: string | number | undefined | null): string | undefined {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] EqualityOperator
src/rate-config.schema.ts:184:33
 
 /** The stored scalar's text form (the database reads jsonb values as text). */
 function storedText(value: string | number | undefined | null): string | undefined {
-  return value === undefined || value === null ? undefined : String(value);
+  return value === undefined || value !== null ? undefined : String(value);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 7ms

 ✓ test/views.test.ts (5 tests) 33ms

[Killed] EqualityOperator
src/rate-config.schema.ts:184:10
 
 /** The stored scalar's text form (the database reads jsonb values as text). */
 function storedText(value: string | number | undefined | null): string | undefined {
-  return value === undefined || value === null ? undefined : String(value);
+  return value !== undefined || value === null ? undefined : String(value);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 28ms

[Killed] BlockStatement
src/rate-config.schema.ts:193:91
  * money is always sealed server-side from the database). Garbage values
  * fall back exactly per §3.3; they never error.
  */
-export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
-  const graceText = storedText(config?.extension?.grace_minutes);
-  const blockText = storedText(config?.extension?.block_minutes);
-  const chargeText = storedText(config?.extension?.block_charge);
-  return {
-    graceMinutes:
-      graceText !== undefined && MINUTES_TEXT_PATTERN.test(graceText)
-        ? parseStoredInteger(graceText)
-        : OVERSTAY_DEFAULTS.grace_minutes,
-    blockMinutes:
-      blockText !== undefined && MINUTES_TEXT_PATTERN.test(blockText) && parseStoredInteger(blockText) > 0
-        ? parseStoredInteger(blockText)
-        : OVERSTAY_DEFAULTS.block_minutes,
-    blockCharge:
-      chargeText !== undefined && MONEY_TEXT_PATTERN.test(chargeText) && Number.parseFloat(chargeText) > 0
-        ? Number.parseFloat(chargeText)
-        : OVERSTAY_DEFAULTS.block_charge,
-  };
-}
+export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 32ms

[Killed] OptionalChaining
src/rate-config.schema.ts:194:32
  * fall back exactly per §3.3; they never error.
  */
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
-  const graceText = storedText(config?.extension?.grace_minutes);
+  const graceText = storedText(config?.extension.grace_minutes);
   const blockText = storedText(config?.extension?.block_minutes);
   const chargeText = storedText(config?.extension?.block_charge);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 9ms

 ✓ test/views.test.ts (5 tests) 36ms

[Killed] OptionalChaining
src/rate-config.schema.ts:194:32
  * fall back exactly per §3.3; they never error.
  */
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
-  const graceText = storedText(config?.extension?.grace_minutes);
+  const graceText = storedText(config.extension?.grace_minutes);
   const blockText = storedText(config?.extension?.block_minutes);
   const chargeText = storedText(config?.extension?.block_charge);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 10ms

 ✓ test/views.test.ts (5 tests) 34ms

[Killed] OptionalChaining
src/rate-config.schema.ts:195:32
  */
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
   const graceText = storedText(config?.extension?.grace_minutes);
-  const blockText = storedText(config?.extension?.block_minutes);
+  const blockText = storedText(config?.extension.block_minutes);
   const chargeText = storedText(config?.extension?.block_charge);
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 12ms

 ✓ test/views.test.ts (5 tests) 36ms

[Killed] OptionalChaining
src/rate-config.schema.ts:195:32
  */
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
   const graceText = storedText(config?.extension?.grace_minutes);
-  const blockText = storedText(config?.extension?.block_minutes);
+  const blockText = storedText(config.extension?.block_minutes);
   const chargeText = storedText(config?.extension?.block_charge);
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 12ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] OptionalChaining
src/rate-config.schema.ts:196:33
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
   const graceText = storedText(config?.extension?.grace_minutes);
   const blockText = storedText(config?.extension?.block_minutes);
-  const chargeText = storedText(config?.extension?.block_charge);
+  const chargeText = storedText(config.extension?.block_charge);
   return {
     graceMinutes:
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 29ms

[Killed] OptionalChaining
src/rate-config.schema.ts:196:33
 export function readOverstayTriple(config: RateConfig | null | undefined): OverstayTriple {
   const graceText = storedText(config?.extension?.grace_minutes);
   const blockText = storedText(config?.extension?.block_minutes);
-  const chargeText = storedText(config?.extension?.block_charge);
+  const chargeText = storedText(config?.extension.block_charge);
   return {
     graceMinutes:
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 11ms

 ✓ test/views.test.ts (5 tests) 34ms

[Killed] LogicalOperator
src/rate-config.schema.ts:199:7
   const chargeText = storedText(config?.extension?.block_charge);
   return {
     graceMinutes:
-      graceText !== undefined && MINUTES_TEXT_PATTERN.test(graceText)
+      graceText !== undefined || MINUTES_TEXT_PATTERN.test(graceText)
         ? parseStoredInteger(graceText)
         : OVERSTAY_DEFAULTS.grace_minutes,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 28ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:199:7
   const chargeText = storedText(config?.extension?.block_charge);
   return {
     graceMinutes:
-      graceText !== undefined && MINUTES_TEXT_PATTERN.test(graceText)
+      false
         ? parseStoredInteger(graceText)
         : OVERSTAY_DEFAULTS.grace_minutes,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] ConditionalExpression
src/rate-config.schema.ts:203:74
         ? parseStoredInteger(graceText)
         : OVERSTAY_DEFAULTS.grace_minutes,
     blockMinutes:
-      blockText !== undefined && MINUTES_TEXT_PATTERN.test(blockText) && parseStoredInteger(blockText) > 0
+      blockText !== undefined && MINUTES_TEXT_PATTERN.test(blockText) && true
         ? parseStoredInteger(blockText)
         : OVERSTAY_DEFAULTS.block_minutes,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 39ms

[Killed] EqualityOperator
src/rate-config.schema.ts:203:74
         ? parseStoredInteger(graceText)
         : OVERSTAY_DEFAULTS.grace_minutes,
     blockMinutes:
-      blockText !== undefined && MINUTES_TEXT_PATTERN.test(blockText) && parseStoredInteger(blockText) > 0
+      blockText !== undefined && MINUTES_TEXT_PATTERN.test(blockText) && parseStoredInteger(blockText) <= 0
         ? parseStoredInteger(blockText)
         : OVERSTAY_DEFAULTS.block_minutes,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 7ms

 ✓ test/views.test.ts (5 tests) 30ms

[Killed] EqualityOperator
src/rate-config.schema.ts:207:7
         ? parseStoredInteger(blockText)
         : OVERSTAY_DEFAULTS.block_minutes,
     blockCharge:
-      chargeText !== undefined && MONEY_TEXT_PATTERN.test(chargeText) && Number.parseFloat(chargeText) > 0
+      chargeText === undefined && MONEY_TEXT_PATTERN.test(chargeText) && Number.parseFloat(chargeText) > 0
         ? Number.parseFloat(chargeText)
         : OVERSTAY_DEFAULTS.block_charge,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 27ms

[Killed] LogicalOperator
src/rate-config.schema.ts:207:7
         ? parseStoredInteger(blockText)
         : OVERSTAY_DEFAULTS.block_minutes,
     blockCharge:
-      chargeText !== undefined && MONEY_TEXT_PATTERN.test(chargeText) && Number.parseFloat(chargeText) > 0
+      chargeText !== undefined && MONEY_TEXT_PATTERN.test(chargeText) || Number.parseFloat(chargeText) > 0
         ? Number.parseFloat(chargeText)
         : OVERSTAY_DEFAULTS.block_charge,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/MODiE/Desktop/Silid-Saas/packages/schemas/.stryker-tmp/sandbox-aHRd4f



 ✓ test/smoke.test.ts (1 test) 8ms

 ✓ test/views.test.ts (5 tests) 34ms
